var links=[
  {source: "海洋", target: "海洋生物", type: "contain", id: 0, relationship: "包含"},
  {source: "海洋生物", target: "脊椎動物", type: "contain", id: 1, relationship: "包含"},
  {source: "脊椎動物", target: "魚綱", type: "contain", id: 2, relationship: "包含"},
  {source: "脊椎動物", target: "爬蟲綱", type: "contain", id: 3, relationship: "包含"},
  {source: "脊椎動物", target: "哺乳綱", type: "contain", id: 4, relationship: "包含"},
  {source: "魚綱", target: "無頷魚", type: "contain", id: 5, relationship: "包含"},
  {source: "魚綱", target: "軟骨魚", type: "contain", id: 6, relationship: "包含"},
  {source: "魚綱", target: "條鰭魚", type: "contain", id: 7, relationship: "包含"},
  {source: "爬蟲綱", target: "海龜科", type: "contain", id: 8, relationship: "包含"},
  {source: "哺乳綱", target: "鯨豚目", type: "contain", id: 9, relationship: "包含"},
  {source: "哺乳綱", target: "食肉目", type: "contain", id: 10, relationship: "包含"},
  {source: "無頷魚", target: "八目鰻", type: "contain", id: 11, relationship: "包含"},
  {source: "無頷魚", target: "盲鰻", type: "contain", id: 12, relationship: "包含"},
  {source: "軟骨魚", target: "魟魚", type: "contain", id: 13, relationship: "包含"},
  {source: "軟骨魚", target: "白眼鯊", type: "contain", id: 14, relationship: "包含"},
  {source: "軟骨魚", target: "鯨鯊", type: "contain", id: 15, relationship: "包含"},
  {source: "條鰭魚", target: "飛魚", type: "contain", id: 16, relationship: "包含"},
  {source: "條鰭魚", target: "翻車魨", type: "contain", id: 17, relationship: "包含"},
  {source: "條鰭魚", target: "鮭魚", type: "contain", id: 18, relationship: "包含"},
  {source: "條鰭魚", target: "比目魚", type: "contain", id: 19, relationship: "包含"},
  {source: "海龜科", target: "綠蠵龜", type: "contain", id: 20, relationship: "包含"},
  {source: "海龜科", target: "赤蠵龜", type: "contain", id: 21, relationship: "包含"},
  {source: "海龜科", target: "欖蠵龜", type: "contain", id: 22, relationship: "包含"},
  {source: "海龜科", target: "革龜", type: "contain", id: 23, relationship: "包含"},
  {source: "海龜科", target: "玳瑁", type: "contain", id: 24, relationship: "包含"},
  {source: "食肉目", target: "海豹科", type: "contain", id: 25, relationship: "包含"},
  {source: "食肉目", target: "海獅科", type: "contain", id: 26, relationship: "包含"},
  {source: "食肉目", target: "海象科", type: "contain", id: 27, relationship: "包含"},
  {source: "鯨豚目", target: "海豚科", type: "contain", id: 28, relationship: "包含"},
  {source: "鯨豚目", target: "鬚鯨", type: "contain", id: 29, relationship: "包含"},
  {source: "鬚鯨", target: "藍鯨", type: "contain", id: 30, relationship: "包含"},
  {source: "海洋", target: "海洋地質", type: "contain", id: 31, relationship: "x"},
  {source: "海洋地質", target: "海洋儀器與觀測", type: "contain", id: 32, relationship: "探測"},
  {source: "海洋地質", target: "海底地形", type: "contain", id: 33, relationship: "分成"},
  {source: "海洋儀器與觀測", target: "聲納", type: "contain", id: 34, relationship: "分成"},
  {source: "海洋儀器與觀測", target: "深海鑽探", type: "contain", id: 35, relationship: "分成"},
  {source: "海洋儀器與觀測", target: "溫鹽深儀", type: "contain", id: 36, relationship: "分成"},
  {source: "海洋儀器與觀測", target: "海地地震儀", type: "contain", id: 37, relationship: "分成"},
  {source: "深海鑽探", target: "古氣候", type: "contain", id: 38, relationship: "重建"},
  {source: "深海鑽探", target: "古海洋", type: "contain", id: 39, relationship: "重建"},
  {source: "溫鹽深儀", target: "鹽度", type: "contain", id: 40, relationship: "探測"},
  {source: "溫鹽深儀", target: "溫度", type: "contain", id: 41, relationship: "探測"},
  {source: "溫鹽深儀", target: "深度", type: "contain", id: 42, relationship: "探測"},
  {source: "海地地震儀", target: "地震", type: "contain", id: 43, relationship: "了解"},
  {source: "海底地形", target: "洋底盆地", type: "contain", id: 44, relationship: "分成"},
  {source: "海底地形", target: "中洋脊", type: "contain", id: 45, relationship: "分成"},
  {source: "海底地形", target: "大陸邊緣", type: "contain", id: 46, relationship: "分成"},
  {source: "海底地形", target: "海溝", type: "contain", id: 47, relationship: "分成"},
  {source: "溫鹽深儀", target: "水團", type: "contain", id: 48, relationship: "知道"},
  {source: "洋底盆地", target: "海底山", type: "contain", id: 49, relationship: "細分"},
  {source: "洋底盆地", target: "深海平原", type: "contain", id: 50, relationship: "細分"},
  {source: "深海鑽探", target: "玄武岩", type: "contain", id: 51, relationship: "產生"},
  {source: "溫鹽深儀", target: "大陸坡", type: "contain", id: 52, relationship: "細分"},
  {source: "溫鹽深儀", target: "大陸棚", type: "contain", id: 53, relationship: "細分"},
  {source: "大陸棚", target: "生產力高", type: "contain", id: 54, relationship: "特性"},
  {source: "大陸棚", target: "多樣性高", type: "contain", id: 55, relationship: "特性"},
  {source: "海獅科", target: "飛魚", type: "resolve", id: 56, relationship: "吃食"},
  {source: "海豚科", target: "藍鯨", type: "resolve", id: 57, relationship: "追逐"},
  {source: "聲納", target: "深度", type: "resolve", id: 58, relationship: "測得"},
  {source: "海溝", target: "地震", type: "resolve", id: 59, relationship: "常發生"},
  {source: "中洋脊", target: "地震", type: "resolve", id: 60, relationship: "常發生"},
];

var routes=[
  {"nodes": ["海洋生物", "脊椎動物"], "path": [
    {"route": [1],
     "node": []},
  ]},
  {"nodes": ["海洋生物", "魚綱"], "path": [
    {"route": [1, 2],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["海洋生物", "爬蟲綱"], "path": [
    {"route": [1, 3],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["海洋生物", "哺乳綱"], "path": [
    {"route": [1, 4],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["海洋生物", "無頷魚"], "path": [
    {"route": [1, 2, 5],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["海洋生物", "軟骨魚"], "path": [
    {"route": [1, 2, 6],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["海洋生物", "條鰭魚"], "path": [
    {"route": [1, 2, 7],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["海洋生物", "海龜科"], "path": [
    {"route": [1, 3, 8],
     "node": ["脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["海洋生物", "鯨豚目"], "path": [
    {"route": [1, 4, 9],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["海洋生物", "食肉目"], "path": [
    {"route": [1, 4, 10],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["海洋生物", "八目鰻"], "path": [
    {"route": [1, 2, 5, 11],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["海洋生物", "盲鰻"], "path": [
    {"route": [1, 2, 5, 12],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["海洋生物", "魟魚"], "path": [
    {"route": [1, 2, 6, 13],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海洋生物", "白眼鯊"], "path": [
    {"route": [1, 2, 6, 14],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海洋生物", "鯨鯊"], "path": [
    {"route": [1, 2, 6, 15],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海洋生物", "飛魚"], "path": [
    {"route": [1, 2, 7, 16],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海洋生物", "翻車魨"], "path": [
    {"route": [1, 2, 7, 17],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海洋生物", "鮭魚"], "path": [
    {"route": [1, 2, 7, 18],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海洋生物", "比目魚"], "path": [
    {"route": [1, 2, 7, 19],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海洋生物", "綠蠵龜"], "path": [
    {"route": [1, 3, 8, 20],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["海洋生物", "赤蠵龜"], "path": [
    {"route": [1, 3, 8, 21],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["海洋生物", "欖蠵龜"], "path": [
    {"route": [1, 3, 8, 22],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["海洋生物", "革龜"], "path": [
    {"route": [1, 3, 8, 23],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["海洋生物", "玳瑁"], "path": [
    {"route": [1, 3, 8, 24],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["海洋生物", "海豹科"], "path": [
    {"route": [1, 4, 10, 25],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海洋生物", "海獅科"], "path": [
    {"route": [1, 4, 10, 26],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海洋生物", "海象科"], "path": [
    {"route": [1, 4, 10, 27],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海洋生物", "海豚科"], "path": [
    {"route": [1, 4, 9, 28],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海洋生物", "鬚鯨"], "path": [
    {"route": [1, 4, 9, 29],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海洋生物", "藍鯨"], "path": [
    {"route": [1, 4, 9, 29, 30],
     "node": ["脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [1, 4, 9, 28, 57],
     "node": ["脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["海洋生物", "海洋地質"], "path": [
    {"route": [0, 31],
     "node": ["海洋"]},
  ]},
  {"nodes": ["海洋生物", "海洋儀器與觀測"], "path": [
    {"route": [0, 31, 32],
     "node": ["海洋","海洋地質"]},
  ]},
  {"nodes": ["海洋生物", "海底地形"], "path": [
    {"route": [0, 31, 33],
     "node": ["海洋","海洋地質"]},
  ]},
  {"nodes": ["海洋生物", "聲納"], "path": [
    {"route": [0, 31, 32, 34],
     "node": ["海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋生物", "深海鑽探"], "path": [
    {"route": [0, 31, 32, 35],
     "node": ["海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋生物", "溫鹽深儀"], "path": [
    {"route": [0, 31, 32, 36],
     "node": ["海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋生物", "海地地震儀"], "path": [
    {"route": [0, 31, 32, 37],
     "node": ["海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋生物", "古氣候"], "path": [
    {"route": [0, 31, 32, 35, 38],
     "node": ["海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋生物", "古海洋"], "path": [
    {"route": [0, 31, 32, 35, 39],
     "node": ["海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋生物", "鹽度"], "path": [
    {"route": [0, 31, 32, 36, 40],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋生物", "溫度"], "path": [
    {"route": [0, 31, 32, 36, 41],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋生物", "深度"], "path": [
    {"route": [0, 31, 32, 36, 42],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [0, 31, 32, 34, 58],
     "node": ["海洋","海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["海洋生物", "地震"], "path": [
    {"route": [0, 31, 32, 37, 43],
     "node": ["海洋","海洋地質","海洋儀器與觀測","海地地震儀"]},
    {"route": [0, 31, 33, 47, 59],
     "node": ["海洋","海洋地質","海底地形","海溝"]},
    {"route": [0, 31, 33, 45, 60],
     "node": ["海洋","海洋地質","海底地形","中洋脊"]},
  ]},
  {"nodes": ["海洋生物", "洋底盆地"], "path": [
    {"route": [0, 31, 33, 44],
     "node": ["海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋生物", "中洋脊"], "path": [
    {"route": [0, 31, 33, 45],
     "node": ["海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋生物", "大陸邊緣"], "path": [
    {"route": [0, 31, 33, 46],
     "node": ["海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋生物", "海溝"], "path": [
    {"route": [0, 31, 33, 47],
     "node": ["海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋生物", "水團"], "path": [
    {"route": [0, 31, 32, 36, 48],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋生物", "海底山"], "path": [
    {"route": [0, 31, 33, 44, 49],
     "node": ["海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋生物", "深海平原"], "path": [
    {"route": [0, 31, 33, 44, 50],
     "node": ["海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋生物", "玄武岩"], "path": [
    {"route": [0, 31, 32, 35, 51],
     "node": ["海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋生物", "大陸坡"], "path": [
    {"route": [0, 31, 32, 36, 52],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋生物", "大陸棚"], "path": [
    {"route": [0, 31, 32, 36, 53],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋生物", "生產力高"], "path": [
    {"route": [0, 31, 32, 36, 53, 54],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海洋生物", "多樣性高"], "path": [
    {"route": [0, 31, 32, 36, 53, 55],
     "node": ["海洋","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["脊椎動物", "魚綱"], "path": [
    {"route": [2],
     "node": []},
  ]},
  {"nodes": ["脊椎動物", "爬蟲綱"], "path": [
    {"route": [3],
     "node": []},
  ]},
  {"nodes": ["脊椎動物", "哺乳綱"], "path": [
    {"route": [4],
     "node": []},
  ]},
  {"nodes": ["脊椎動物", "無頷魚"], "path": [
    {"route": [2, 5],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["脊椎動物", "軟骨魚"], "path": [
    {"route": [2, 6],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["脊椎動物", "條鰭魚"], "path": [
    {"route": [2, 7],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["脊椎動物", "海龜科"], "path": [
    {"route": [3, 8],
     "node": ["爬蟲綱"]},
  ]},
  {"nodes": ["脊椎動物", "鯨豚目"], "path": [
    {"route": [4, 9],
     "node": ["哺乳綱"]},
  ]},
  {"nodes": ["脊椎動物", "食肉目"], "path": [
    {"route": [4, 10],
     "node": ["哺乳綱"]},
  ]},
  {"nodes": ["脊椎動物", "八目鰻"], "path": [
    {"route": [2, 5, 11],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["脊椎動物", "盲鰻"], "path": [
    {"route": [2, 5, 12],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["脊椎動物", "魟魚"], "path": [
    {"route": [2, 6, 13],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["脊椎動物", "白眼鯊"], "path": [
    {"route": [2, 6, 14],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["脊椎動物", "鯨鯊"], "path": [
    {"route": [2, 6, 15],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["脊椎動物", "飛魚"], "path": [
    {"route": [2, 7, 16],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["脊椎動物", "翻車魨"], "path": [
    {"route": [2, 7, 17],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["脊椎動物", "鮭魚"], "path": [
    {"route": [2, 7, 18],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["脊椎動物", "比目魚"], "path": [
    {"route": [2, 7, 19],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["脊椎動物", "綠蠵龜"], "path": [
    {"route": [3, 8, 20],
     "node": ["爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["脊椎動物", "赤蠵龜"], "path": [
    {"route": [3, 8, 21],
     "node": ["爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["脊椎動物", "欖蠵龜"], "path": [
    {"route": [3, 8, 22],
     "node": ["爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["脊椎動物", "革龜"], "path": [
    {"route": [3, 8, 23],
     "node": ["爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["脊椎動物", "玳瑁"], "path": [
    {"route": [3, 8, 24],
     "node": ["爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["脊椎動物", "海豹科"], "path": [
    {"route": [4, 10, 25],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["脊椎動物", "海獅科"], "path": [
    {"route": [4, 10, 26],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["脊椎動物", "海象科"], "path": [
    {"route": [4, 10, 27],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["脊椎動物", "海豚科"], "path": [
    {"route": [4, 9, 28],
     "node": ["哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["脊椎動物", "鬚鯨"], "path": [
    {"route": [4, 9, 29],
     "node": ["哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["脊椎動物", "藍鯨"], "path": [
    {"route": [4, 9, 29, 30],
     "node": ["哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [4, 9, 28, 57],
     "node": ["哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["脊椎動物", "海洋地質"], "path": [
    {"route": [1, 0, 31],
     "node": ["海洋生物","海洋"]},
  ]},
  {"nodes": ["脊椎動物", "海洋儀器與觀測"], "path": [
    {"route": [1, 0, 31, 32],
     "node": ["海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["脊椎動物", "海底地形"], "path": [
    {"route": [1, 0, 31, 33],
     "node": ["海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["脊椎動物", "聲納"], "path": [
    {"route": [1, 0, 31, 32, 34],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["脊椎動物", "深海鑽探"], "path": [
    {"route": [1, 0, 31, 32, 35],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["脊椎動物", "溫鹽深儀"], "path": [
    {"route": [1, 0, 31, 32, 36],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["脊椎動物", "海地地震儀"], "path": [
    {"route": [1, 0, 31, 32, 37],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["脊椎動物", "古氣候"], "path": [
    {"route": [1, 0, 31, 32, 35, 38],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["脊椎動物", "古海洋"], "path": [
    {"route": [1, 0, 31, 32, 35, 39],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["脊椎動物", "鹽度"], "path": [
    {"route": [1, 0, 31, 32, 36, 40],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["脊椎動物", "溫度"], "path": [
    {"route": [1, 0, 31, 32, 36, 41],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["脊椎動物", "深度"], "path": [
    {"route": [1, 0, 31, 32, 36, 42],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [1, 0, 31, 32, 34, 58],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["脊椎動物", "地震"], "path": [
    {"route": [1, 0, 31, 32, 37, 43],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","海地地震儀"]},
    {"route": [1, 0, 31, 33, 47, 59],
     "node": ["海洋生物","海洋","海洋地質","海底地形","海溝"]},
    {"route": [1, 0, 31, 33, 45, 60],
     "node": ["海洋生物","海洋","海洋地質","海底地形","中洋脊"]},
  ]},
  {"nodes": ["脊椎動物", "洋底盆地"], "path": [
    {"route": [1, 0, 31, 33, 44],
     "node": ["海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["脊椎動物", "中洋脊"], "path": [
    {"route": [1, 0, 31, 33, 45],
     "node": ["海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["脊椎動物", "大陸邊緣"], "path": [
    {"route": [1, 0, 31, 33, 46],
     "node": ["海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["脊椎動物", "海溝"], "path": [
    {"route": [1, 0, 31, 33, 47],
     "node": ["海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["脊椎動物", "水團"], "path": [
    {"route": [1, 0, 31, 32, 36, 48],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["脊椎動物", "海底山"], "path": [
    {"route": [1, 0, 31, 33, 44, 49],
     "node": ["海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["脊椎動物", "深海平原"], "path": [
    {"route": [1, 0, 31, 33, 44, 50],
     "node": ["海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["脊椎動物", "玄武岩"], "path": [
    {"route": [1, 0, 31, 32, 35, 51],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["脊椎動物", "大陸坡"], "path": [
    {"route": [1, 0, 31, 32, 36, 52],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["脊椎動物", "大陸棚"], "path": [
    {"route": [1, 0, 31, 32, 36, 53],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["脊椎動物", "生產力高"], "path": [
    {"route": [1, 0, 31, 32, 36, 53, 54],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["脊椎動物", "多樣性高"], "path": [
    {"route": [1, 0, 31, 32, 36, 53, 55],
     "node": ["海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["魚綱", "爬蟲綱"], "path": [
    {"route": [2, 3],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["魚綱", "哺乳綱"], "path": [
    {"route": [2, 4],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["魚綱", "無頷魚"], "path": [
    {"route": [5],
     "node": []},
  ]},
  {"nodes": ["魚綱", "軟骨魚"], "path": [
    {"route": [6],
     "node": []},
  ]},
  {"nodes": ["魚綱", "條鰭魚"], "path": [
    {"route": [7],
     "node": []},
  ]},
  {"nodes": ["魚綱", "海龜科"], "path": [
    {"route": [2, 3, 8],
     "node": ["脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["魚綱", "鯨豚目"], "path": [
    {"route": [2, 4, 9],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["魚綱", "食肉目"], "path": [
    {"route": [2, 4, 10],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["魚綱", "八目鰻"], "path": [
    {"route": [5, 11],
     "node": ["無頷魚"]},
  ]},
  {"nodes": ["魚綱", "盲鰻"], "path": [
    {"route": [5, 12],
     "node": ["無頷魚"]},
  ]},
  {"nodes": ["魚綱", "魟魚"], "path": [
    {"route": [6, 13],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["魚綱", "白眼鯊"], "path": [
    {"route": [6, 14],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["魚綱", "鯨鯊"], "path": [
    {"route": [6, 15],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["魚綱", "飛魚"], "path": [
    {"route": [7, 16],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["魚綱", "翻車魨"], "path": [
    {"route": [7, 17],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["魚綱", "鮭魚"], "path": [
    {"route": [7, 18],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["魚綱", "比目魚"], "path": [
    {"route": [7, 19],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["魚綱", "綠蠵龜"], "path": [
    {"route": [2, 3, 8, 20],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魚綱", "赤蠵龜"], "path": [
    {"route": [2, 3, 8, 21],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魚綱", "欖蠵龜"], "path": [
    {"route": [2, 3, 8, 22],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魚綱", "革龜"], "path": [
    {"route": [2, 3, 8, 23],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魚綱", "玳瑁"], "path": [
    {"route": [2, 3, 8, 24],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魚綱", "海豹科"], "path": [
    {"route": [2, 4, 10, 25],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["魚綱", "海獅科"], "path": [
    {"route": [7, 16, 56],
     "node": ["條鰭魚","飛魚"]},
  ]},
  {"nodes": ["魚綱", "海象科"], "path": [
    {"route": [2, 4, 10, 27],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["魚綱", "海豚科"], "path": [
    {"route": [2, 4, 9, 28],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["魚綱", "鬚鯨"], "path": [
    {"route": [2, 4, 9, 29],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["魚綱", "藍鯨"], "path": [
    {"route": [2, 4, 9, 29, 30],
     "node": ["脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [2, 4, 9, 28, 57],
     "node": ["脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["魚綱", "海洋地質"], "path": [
    {"route": [2, 1, 0, 31],
     "node": ["脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["魚綱", "海洋儀器與觀測"], "path": [
    {"route": [2, 1, 0, 31, 32],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["魚綱", "海底地形"], "path": [
    {"route": [2, 1, 0, 31, 33],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["魚綱", "聲納"], "path": [
    {"route": [2, 1, 0, 31, 32, 34],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["魚綱", "深海鑽探"], "path": [
    {"route": [2, 1, 0, 31, 32, 35],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["魚綱", "溫鹽深儀"], "path": [
    {"route": [2, 1, 0, 31, 32, 36],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["魚綱", "海地地震儀"], "path": [
    {"route": [2, 1, 0, 31, 32, 37],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["魚綱", "古氣候"], "path": [
    {"route": [2, 1, 0, 31, 32, 35, 38],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["魚綱", "古海洋"], "path": [
    {"route": [2, 1, 0, 31, 32, 35, 39],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["魚綱", "鹽度"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 40],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["魚綱", "溫度"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 41],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["魚綱", "深度"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 42],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [2, 1, 0, 31, 32, 34, 58],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["魚綱", "地震"], "path": [
    {"route": [2, 1, 0, 31, 32, 37, 43],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","海地地震儀"]},
    {"route": [2, 1, 0, 31, 33, 47, 59],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","海溝"]},
    {"route": [2, 1, 0, 31, 33, 45, 60],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","中洋脊"]},
  ]},
  {"nodes": ["魚綱", "洋底盆地"], "path": [
    {"route": [2, 1, 0, 31, 33, 44],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["魚綱", "中洋脊"], "path": [
    {"route": [2, 1, 0, 31, 33, 45],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["魚綱", "大陸邊緣"], "path": [
    {"route": [2, 1, 0, 31, 33, 46],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["魚綱", "海溝"], "path": [
    {"route": [2, 1, 0, 31, 33, 47],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["魚綱", "水團"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 48],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["魚綱", "海底山"], "path": [
    {"route": [2, 1, 0, 31, 33, 44, 49],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["魚綱", "深海平原"], "path": [
    {"route": [2, 1, 0, 31, 33, 44, 50],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["魚綱", "玄武岩"], "path": [
    {"route": [2, 1, 0, 31, 32, 35, 51],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["魚綱", "大陸坡"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 52],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["魚綱", "大陸棚"], "path": [
    {"route": [2, 1, 0, 31, 32, 36, 53],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["爬蟲綱", "哺乳綱"], "path": [
    {"route": [3, 4],
     "node": ["脊椎動物"]},
  ]},
  {"nodes": ["爬蟲綱", "無頷魚"], "path": [
    {"route": [3, 2, 5],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["爬蟲綱", "軟骨魚"], "path": [
    {"route": [3, 2, 6],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["爬蟲綱", "條鰭魚"], "path": [
    {"route": [3, 2, 7],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["爬蟲綱", "海龜科"], "path": [
    {"route": [8],
     "node": []},
  ]},
  {"nodes": ["爬蟲綱", "鯨豚目"], "path": [
    {"route": [3, 4, 9],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["爬蟲綱", "食肉目"], "path": [
    {"route": [3, 4, 10],
     "node": ["脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["爬蟲綱", "八目鰻"], "path": [
    {"route": [3, 2, 5, 11],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["爬蟲綱", "盲鰻"], "path": [
    {"route": [3, 2, 5, 12],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["爬蟲綱", "魟魚"], "path": [
    {"route": [3, 2, 6, 13],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["爬蟲綱", "白眼鯊"], "path": [
    {"route": [3, 2, 6, 14],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["爬蟲綱", "鯨鯊"], "path": [
    {"route": [3, 2, 6, 15],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["爬蟲綱", "飛魚"], "path": [
    {"route": [3, 2, 7, 16],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["爬蟲綱", "翻車魨"], "path": [
    {"route": [3, 2, 7, 17],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["爬蟲綱", "鮭魚"], "path": [
    {"route": [3, 2, 7, 18],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["爬蟲綱", "比目魚"], "path": [
    {"route": [3, 2, 7, 19],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["爬蟲綱", "綠蠵龜"], "path": [
    {"route": [8, 20],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["爬蟲綱", "赤蠵龜"], "path": [
    {"route": [8, 21],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["爬蟲綱", "欖蠵龜"], "path": [
    {"route": [8, 22],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["爬蟲綱", "革龜"], "path": [
    {"route": [8, 23],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["爬蟲綱", "玳瑁"], "path": [
    {"route": [8, 24],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["爬蟲綱", "海豹科"], "path": [
    {"route": [3, 4, 10, 25],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["爬蟲綱", "海獅科"], "path": [
    {"route": [3, 4, 10, 26],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["爬蟲綱", "海象科"], "path": [
    {"route": [3, 4, 10, 27],
     "node": ["脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["爬蟲綱", "海豚科"], "path": [
    {"route": [3, 4, 9, 28],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["爬蟲綱", "鬚鯨"], "path": [
    {"route": [3, 4, 9, 29],
     "node": ["脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["爬蟲綱", "藍鯨"], "path": [
    {"route": [3, 4, 9, 29, 30],
     "node": ["脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [3, 4, 9, 28, 57],
     "node": ["脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["爬蟲綱", "海洋地質"], "path": [
    {"route": [3, 1, 0, 31],
     "node": ["脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["爬蟲綱", "海洋儀器與觀測"], "path": [
    {"route": [3, 1, 0, 31, 32],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["爬蟲綱", "海底地形"], "path": [
    {"route": [3, 1, 0, 31, 33],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["爬蟲綱", "聲納"], "path": [
    {"route": [3, 1, 0, 31, 32, 34],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["爬蟲綱", "深海鑽探"], "path": [
    {"route": [3, 1, 0, 31, 32, 35],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["爬蟲綱", "溫鹽深儀"], "path": [
    {"route": [3, 1, 0, 31, 32, 36],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["爬蟲綱", "海地地震儀"], "path": [
    {"route": [3, 1, 0, 31, 32, 37],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["爬蟲綱", "古氣候"], "path": [
    {"route": [3, 1, 0, 31, 32, 35, 38],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["爬蟲綱", "古海洋"], "path": [
    {"route": [3, 1, 0, 31, 32, 35, 39],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["爬蟲綱", "鹽度"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 40],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["爬蟲綱", "溫度"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 41],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["爬蟲綱", "深度"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 42],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [3, 1, 0, 31, 32, 34, 58],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["爬蟲綱", "地震"], "path": [
    {"route": [3, 1, 0, 31, 32, 37, 43],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","海地地震儀"]},
    {"route": [3, 1, 0, 31, 33, 47, 59],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","海溝"]},
    {"route": [3, 1, 0, 31, 33, 45, 60],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","中洋脊"]},
  ]},
  {"nodes": ["爬蟲綱", "洋底盆地"], "path": [
    {"route": [3, 1, 0, 31, 33, 44],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["爬蟲綱", "中洋脊"], "path": [
    {"route": [3, 1, 0, 31, 33, 45],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["爬蟲綱", "大陸邊緣"], "path": [
    {"route": [3, 1, 0, 31, 33, 46],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["爬蟲綱", "海溝"], "path": [
    {"route": [3, 1, 0, 31, 33, 47],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["爬蟲綱", "水團"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 48],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["爬蟲綱", "海底山"], "path": [
    {"route": [3, 1, 0, 31, 33, 44, 49],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["爬蟲綱", "深海平原"], "path": [
    {"route": [3, 1, 0, 31, 33, 44, 50],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["爬蟲綱", "玄武岩"], "path": [
    {"route": [3, 1, 0, 31, 32, 35, 51],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["爬蟲綱", "大陸坡"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 52],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["爬蟲綱", "大陸棚"], "path": [
    {"route": [3, 1, 0, 31, 32, 36, 53],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["哺乳綱", "無頷魚"], "path": [
    {"route": [4, 2, 5],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["哺乳綱", "軟骨魚"], "path": [
    {"route": [4, 2, 6],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["哺乳綱", "條鰭魚"], "path": [
    {"route": [4, 2, 7],
     "node": ["脊椎動物","魚綱"]},
  ]},
  {"nodes": ["哺乳綱", "海龜科"], "path": [
    {"route": [4, 3, 8],
     "node": ["脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["哺乳綱", "鯨豚目"], "path": [
    {"route": [9],
     "node": []},
  ]},
  {"nodes": ["哺乳綱", "食肉目"], "path": [
    {"route": [10],
     "node": []},
  ]},
  {"nodes": ["哺乳綱", "八目鰻"], "path": [
    {"route": [4, 2, 5, 11],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["哺乳綱", "盲鰻"], "path": [
    {"route": [4, 2, 5, 12],
     "node": ["脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["哺乳綱", "魟魚"], "path": [
    {"route": [4, 2, 6, 13],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["哺乳綱", "白眼鯊"], "path": [
    {"route": [4, 2, 6, 14],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["哺乳綱", "鯨鯊"], "path": [
    {"route": [4, 2, 6, 15],
     "node": ["脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["哺乳綱", "飛魚"], "path": [
    {"route": [10, 26, 56],
     "node": ["食肉目","海獅科"]},
  ]},
  {"nodes": ["哺乳綱", "翻車魨"], "path": [
    {"route": [4, 2, 7, 17],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["哺乳綱", "鮭魚"], "path": [
    {"route": [4, 2, 7, 18],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["哺乳綱", "比目魚"], "path": [
    {"route": [4, 2, 7, 19],
     "node": ["脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["哺乳綱", "綠蠵龜"], "path": [
    {"route": [4, 3, 8, 20],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["哺乳綱", "赤蠵龜"], "path": [
    {"route": [4, 3, 8, 21],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["哺乳綱", "欖蠵龜"], "path": [
    {"route": [4, 3, 8, 22],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["哺乳綱", "革龜"], "path": [
    {"route": [4, 3, 8, 23],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["哺乳綱", "玳瑁"], "path": [
    {"route": [4, 3, 8, 24],
     "node": ["脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["哺乳綱", "海豹科"], "path": [
    {"route": [10, 25],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["哺乳綱", "海獅科"], "path": [
    {"route": [10, 26],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["哺乳綱", "海象科"], "path": [
    {"route": [10, 27],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["哺乳綱", "海豚科"], "path": [
    {"route": [9, 28],
     "node": ["鯨豚目"]},
  ]},
  {"nodes": ["哺乳綱", "鬚鯨"], "path": [
    {"route": [9, 29],
     "node": ["鯨豚目"]},
  ]},
  {"nodes": ["哺乳綱", "藍鯨"], "path": [
    {"route": [9, 29, 30],
     "node": ["鯨豚目","鬚鯨"]},
    {"route": [9, 28, 57],
     "node": ["鯨豚目","海豚科"]},
  ]},
  {"nodes": ["哺乳綱", "海洋地質"], "path": [
    {"route": [4, 1, 0, 31],
     "node": ["脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["哺乳綱", "海洋儀器與觀測"], "path": [
    {"route": [4, 1, 0, 31, 32],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["哺乳綱", "海底地形"], "path": [
    {"route": [4, 1, 0, 31, 33],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["哺乳綱", "聲納"], "path": [
    {"route": [4, 1, 0, 31, 32, 34],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["哺乳綱", "深海鑽探"], "path": [
    {"route": [4, 1, 0, 31, 32, 35],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["哺乳綱", "溫鹽深儀"], "path": [
    {"route": [4, 1, 0, 31, 32, 36],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["哺乳綱", "海地地震儀"], "path": [
    {"route": [4, 1, 0, 31, 32, 37],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["哺乳綱", "古氣候"], "path": [
    {"route": [4, 1, 0, 31, 32, 35, 38],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["哺乳綱", "古海洋"], "path": [
    {"route": [4, 1, 0, 31, 32, 35, 39],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["哺乳綱", "鹽度"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 40],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["哺乳綱", "溫度"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 41],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["哺乳綱", "深度"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 42],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [4, 1, 0, 31, 32, 34, 58],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["哺乳綱", "地震"], "path": [
    {"route": [4, 1, 0, 31, 32, 37, 43],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","海地地震儀"]},
    {"route": [4, 1, 0, 31, 33, 47, 59],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","海溝"]},
    {"route": [4, 1, 0, 31, 33, 45, 60],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","中洋脊"]},
  ]},
  {"nodes": ["哺乳綱", "洋底盆地"], "path": [
    {"route": [4, 1, 0, 31, 33, 44],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["哺乳綱", "中洋脊"], "path": [
    {"route": [4, 1, 0, 31, 33, 45],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["哺乳綱", "大陸邊緣"], "path": [
    {"route": [4, 1, 0, 31, 33, 46],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["哺乳綱", "海溝"], "path": [
    {"route": [4, 1, 0, 31, 33, 47],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["哺乳綱", "水團"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 48],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["哺乳綱", "海底山"], "path": [
    {"route": [4, 1, 0, 31, 33, 44, 49],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["哺乳綱", "深海平原"], "path": [
    {"route": [4, 1, 0, 31, 33, 44, 50],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["哺乳綱", "玄武岩"], "path": [
    {"route": [4, 1, 0, 31, 32, 35, 51],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["哺乳綱", "大陸坡"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 52],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["哺乳綱", "大陸棚"], "path": [
    {"route": [4, 1, 0, 31, 32, 36, 53],
     "node": ["脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["無頷魚", "軟骨魚"], "path": [
    {"route": [5, 6],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["無頷魚", "條鰭魚"], "path": [
    {"route": [5, 7],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["無頷魚", "海龜科"], "path": [
    {"route": [5, 2, 3, 8],
     "node": ["魚綱","脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["無頷魚", "鯨豚目"], "path": [
    {"route": [5, 2, 4, 9],
     "node": ["魚綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["無頷魚", "食肉目"], "path": [
    {"route": [5, 2, 4, 10],
     "node": ["魚綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["無頷魚", "八目鰻"], "path": [
    {"route": [11],
     "node": []},
  ]},
  {"nodes": ["無頷魚", "盲鰻"], "path": [
    {"route": [12],
     "node": []},
  ]},
  {"nodes": ["無頷魚", "魟魚"], "path": [
    {"route": [5, 6, 13],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["無頷魚", "白眼鯊"], "path": [
    {"route": [5, 6, 14],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["無頷魚", "鯨鯊"], "path": [
    {"route": [5, 6, 15],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["無頷魚", "飛魚"], "path": [
    {"route": [5, 7, 16],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["無頷魚", "翻車魨"], "path": [
    {"route": [5, 7, 17],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["無頷魚", "鮭魚"], "path": [
    {"route": [5, 7, 18],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["無頷魚", "比目魚"], "path": [
    {"route": [5, 7, 19],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["無頷魚", "綠蠵龜"], "path": [
    {"route": [5, 2, 3, 8, 20],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["無頷魚", "赤蠵龜"], "path": [
    {"route": [5, 2, 3, 8, 21],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["無頷魚", "欖蠵龜"], "path": [
    {"route": [5, 2, 3, 8, 22],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["無頷魚", "革龜"], "path": [
    {"route": [5, 2, 3, 8, 23],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["無頷魚", "玳瑁"], "path": [
    {"route": [5, 2, 3, 8, 24],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["無頷魚", "海豹科"], "path": [
    {"route": [5, 2, 4, 10, 25],
     "node": ["魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["無頷魚", "海獅科"], "path": [
    {"route": [5, 7, 16, 56],
     "node": ["魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["無頷魚", "海象科"], "path": [
    {"route": [5, 2, 4, 10, 27],
     "node": ["魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["無頷魚", "海豚科"], "path": [
    {"route": [5, 2, 4, 9, 28],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["無頷魚", "鬚鯨"], "path": [
    {"route": [5, 2, 4, 9, 29],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["無頷魚", "藍鯨"], "path": [
    {"route": [5, 2, 4, 9, 29, 30],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [5, 2, 4, 9, 28, 57],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["無頷魚", "海洋地質"], "path": [
    {"route": [5, 2, 1, 0, 31],
     "node": ["魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["無頷魚", "海洋儀器與觀測"], "path": [
    {"route": [5, 2, 1, 0, 31, 32],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["無頷魚", "海底地形"], "path": [
    {"route": [5, 2, 1, 0, 31, 33],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["無頷魚", "聲納"], "path": [
    {"route": [5, 2, 1, 0, 31, 32, 34],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["無頷魚", "深海鑽探"], "path": [
    {"route": [5, 2, 1, 0, 31, 32, 35],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["無頷魚", "溫鹽深儀"], "path": [
    {"route": [5, 2, 1, 0, 31, 32, 36],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["無頷魚", "海地地震儀"], "path": [
    {"route": [5, 2, 1, 0, 31, 32, 37],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["無頷魚", "洋底盆地"], "path": [
    {"route": [5, 2, 1, 0, 31, 33, 44],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["無頷魚", "中洋脊"], "path": [
    {"route": [5, 2, 1, 0, 31, 33, 45],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["無頷魚", "大陸邊緣"], "path": [
    {"route": [5, 2, 1, 0, 31, 33, 46],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["無頷魚", "海溝"], "path": [
    {"route": [5, 2, 1, 0, 31, 33, 47],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["軟骨魚", "條鰭魚"], "path": [
    {"route": [6, 7],
     "node": ["魚綱"]},
  ]},
  {"nodes": ["軟骨魚", "海龜科"], "path": [
    {"route": [6, 2, 3, 8],
     "node": ["魚綱","脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["軟骨魚", "鯨豚目"], "path": [
    {"route": [6, 2, 4, 9],
     "node": ["魚綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["軟骨魚", "食肉目"], "path": [
    {"route": [6, 2, 4, 10],
     "node": ["魚綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["軟骨魚", "八目鰻"], "path": [
    {"route": [6, 5, 11],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["軟骨魚", "盲鰻"], "path": [
    {"route": [6, 5, 12],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["軟骨魚", "魟魚"], "path": [
    {"route": [13],
     "node": []},
  ]},
  {"nodes": ["軟骨魚", "白眼鯊"], "path": [
    {"route": [14],
     "node": []},
  ]},
  {"nodes": ["軟骨魚", "鯨鯊"], "path": [
    {"route": [15],
     "node": []},
  ]},
  {"nodes": ["軟骨魚", "飛魚"], "path": [
    {"route": [6, 7, 16],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["軟骨魚", "翻車魨"], "path": [
    {"route": [6, 7, 17],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["軟骨魚", "鮭魚"], "path": [
    {"route": [6, 7, 18],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["軟骨魚", "比目魚"], "path": [
    {"route": [6, 7, 19],
     "node": ["魚綱","條鰭魚"]},
  ]},
  {"nodes": ["軟骨魚", "綠蠵龜"], "path": [
    {"route": [6, 2, 3, 8, 20],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["軟骨魚", "赤蠵龜"], "path": [
    {"route": [6, 2, 3, 8, 21],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["軟骨魚", "欖蠵龜"], "path": [
    {"route": [6, 2, 3, 8, 22],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["軟骨魚", "革龜"], "path": [
    {"route": [6, 2, 3, 8, 23],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["軟骨魚", "玳瑁"], "path": [
    {"route": [6, 2, 3, 8, 24],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["軟骨魚", "海豹科"], "path": [
    {"route": [6, 2, 4, 10, 25],
     "node": ["魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["軟骨魚", "海獅科"], "path": [
    {"route": [6, 7, 16, 56],
     "node": ["魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["軟骨魚", "海象科"], "path": [
    {"route": [6, 2, 4, 10, 27],
     "node": ["魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["軟骨魚", "海豚科"], "path": [
    {"route": [6, 2, 4, 9, 28],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["軟骨魚", "鬚鯨"], "path": [
    {"route": [6, 2, 4, 9, 29],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["軟骨魚", "藍鯨"], "path": [
    {"route": [6, 2, 4, 9, 29, 30],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [6, 2, 4, 9, 28, 57],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["軟骨魚", "海洋地質"], "path": [
    {"route": [6, 2, 1, 0, 31],
     "node": ["魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["軟骨魚", "海洋儀器與觀測"], "path": [
    {"route": [6, 2, 1, 0, 31, 32],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["軟骨魚", "海底地形"], "path": [
    {"route": [6, 2, 1, 0, 31, 33],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["軟骨魚", "聲納"], "path": [
    {"route": [6, 2, 1, 0, 31, 32, 34],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["軟骨魚", "深海鑽探"], "path": [
    {"route": [6, 2, 1, 0, 31, 32, 35],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["軟骨魚", "溫鹽深儀"], "path": [
    {"route": [6, 2, 1, 0, 31, 32, 36],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["軟骨魚", "海地地震儀"], "path": [
    {"route": [6, 2, 1, 0, 31, 32, 37],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["軟骨魚", "洋底盆地"], "path": [
    {"route": [6, 2, 1, 0, 31, 33, 44],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["軟骨魚", "中洋脊"], "path": [
    {"route": [6, 2, 1, 0, 31, 33, 45],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["軟骨魚", "大陸邊緣"], "path": [
    {"route": [6, 2, 1, 0, 31, 33, 46],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["軟骨魚", "海溝"], "path": [
    {"route": [6, 2, 1, 0, 31, 33, 47],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["條鰭魚", "海龜科"], "path": [
    {"route": [7, 2, 3, 8],
     "node": ["魚綱","脊椎動物","爬蟲綱"]},
  ]},
  {"nodes": ["條鰭魚", "鯨豚目"], "path": [
    {"route": [7, 2, 4, 9],
     "node": ["魚綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["條鰭魚", "食肉目"], "path": [
    {"route": [16, 56, 26],
     "node": ["飛魚","海獅科"]},
  ]},
  {"nodes": ["條鰭魚", "八目鰻"], "path": [
    {"route": [7, 5, 11],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["條鰭魚", "盲鰻"], "path": [
    {"route": [7, 5, 12],
     "node": ["魚綱","無頷魚"]},
  ]},
  {"nodes": ["條鰭魚", "魟魚"], "path": [
    {"route": [7, 6, 13],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["條鰭魚", "白眼鯊"], "path": [
    {"route": [7, 6, 14],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["條鰭魚", "鯨鯊"], "path": [
    {"route": [7, 6, 15],
     "node": ["魚綱","軟骨魚"]},
  ]},
  {"nodes": ["條鰭魚", "飛魚"], "path": [
    {"route": [16],
     "node": []},
  ]},
  {"nodes": ["條鰭魚", "翻車魨"], "path": [
    {"route": [17],
     "node": []},
  ]},
  {"nodes": ["條鰭魚", "鮭魚"], "path": [
    {"route": [18],
     "node": []},
  ]},
  {"nodes": ["條鰭魚", "比目魚"], "path": [
    {"route": [19],
     "node": []},
  ]},
  {"nodes": ["條鰭魚", "綠蠵龜"], "path": [
    {"route": [7, 2, 3, 8, 20],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["條鰭魚", "赤蠵龜"], "path": [
    {"route": [7, 2, 3, 8, 21],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["條鰭魚", "欖蠵龜"], "path": [
    {"route": [7, 2, 3, 8, 22],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["條鰭魚", "革龜"], "path": [
    {"route": [7, 2, 3, 8, 23],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["條鰭魚", "玳瑁"], "path": [
    {"route": [7, 2, 3, 8, 24],
     "node": ["魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["條鰭魚", "海豹科"], "path": [
    {"route": [16, 56, 26, 25],
     "node": ["飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["條鰭魚", "海獅科"], "path": [
    {"route": [16, 56],
     "node": ["飛魚"]},
  ]},
  {"nodes": ["條鰭魚", "海象科"], "path": [
    {"route": [16, 56, 26, 27],
     "node": ["飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["條鰭魚", "海豚科"], "path": [
    {"route": [7, 2, 4, 9, 28],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["條鰭魚", "鬚鯨"], "path": [
    {"route": [7, 2, 4, 9, 29],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["條鰭魚", "藍鯨"], "path": [
    {"route": [7, 2, 4, 9, 29, 30],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [7, 2, 4, 9, 28, 57],
     "node": ["魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["條鰭魚", "海洋地質"], "path": [
    {"route": [7, 2, 1, 0, 31],
     "node": ["魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["條鰭魚", "海洋儀器與觀測"], "path": [
    {"route": [7, 2, 1, 0, 31, 32],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["條鰭魚", "海底地形"], "path": [
    {"route": [7, 2, 1, 0, 31, 33],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["條鰭魚", "聲納"], "path": [
    {"route": [7, 2, 1, 0, 31, 32, 34],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["條鰭魚", "深海鑽探"], "path": [
    {"route": [7, 2, 1, 0, 31, 32, 35],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["條鰭魚", "溫鹽深儀"], "path": [
    {"route": [7, 2, 1, 0, 31, 32, 36],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["條鰭魚", "海地地震儀"], "path": [
    {"route": [7, 2, 1, 0, 31, 32, 37],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["條鰭魚", "洋底盆地"], "path": [
    {"route": [7, 2, 1, 0, 31, 33, 44],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["條鰭魚", "中洋脊"], "path": [
    {"route": [7, 2, 1, 0, 31, 33, 45],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["條鰭魚", "大陸邊緣"], "path": [
    {"route": [7, 2, 1, 0, 31, 33, 46],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["條鰭魚", "海溝"], "path": [
    {"route": [7, 2, 1, 0, 31, 33, 47],
     "node": ["魚綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海龜科", "鯨豚目"], "path": [
    {"route": [8, 3, 4, 9],
     "node": ["爬蟲綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["海龜科", "食肉目"], "path": [
    {"route": [8, 3, 4, 10],
     "node": ["爬蟲綱","脊椎動物","哺乳綱"]},
  ]},
  {"nodes": ["海龜科", "八目鰻"], "path": [
    {"route": [8, 3, 2, 5, 11],
     "node": ["爬蟲綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["海龜科", "盲鰻"], "path": [
    {"route": [8, 3, 2, 5, 12],
     "node": ["爬蟲綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["海龜科", "魟魚"], "path": [
    {"route": [8, 3, 2, 6, 13],
     "node": ["爬蟲綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海龜科", "白眼鯊"], "path": [
    {"route": [8, 3, 2, 6, 14],
     "node": ["爬蟲綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海龜科", "鯨鯊"], "path": [
    {"route": [8, 3, 2, 6, 15],
     "node": ["爬蟲綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["海龜科", "飛魚"], "path": [
    {"route": [8, 3, 2, 7, 16],
     "node": ["爬蟲綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海龜科", "翻車魨"], "path": [
    {"route": [8, 3, 2, 7, 17],
     "node": ["爬蟲綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海龜科", "鮭魚"], "path": [
    {"route": [8, 3, 2, 7, 18],
     "node": ["爬蟲綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海龜科", "比目魚"], "path": [
    {"route": [8, 3, 2, 7, 19],
     "node": ["爬蟲綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["海龜科", "綠蠵龜"], "path": [
    {"route": [20],
     "node": []},
  ]},
  {"nodes": ["海龜科", "赤蠵龜"], "path": [
    {"route": [21],
     "node": []},
  ]},
  {"nodes": ["海龜科", "欖蠵龜"], "path": [
    {"route": [22],
     "node": []},
  ]},
  {"nodes": ["海龜科", "革龜"], "path": [
    {"route": [23],
     "node": []},
  ]},
  {"nodes": ["海龜科", "玳瑁"], "path": [
    {"route": [24],
     "node": []},
  ]},
  {"nodes": ["海龜科", "海豹科"], "path": [
    {"route": [8, 3, 4, 10, 25],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海龜科", "海獅科"], "path": [
    {"route": [8, 3, 4, 10, 26],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海龜科", "海象科"], "path": [
    {"route": [8, 3, 4, 10, 27],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["海龜科", "海豚科"], "path": [
    {"route": [8, 3, 4, 9, 28],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海龜科", "鬚鯨"], "path": [
    {"route": [8, 3, 4, 9, 29],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海龜科", "藍鯨"], "path": [
    {"route": [8, 3, 4, 9, 29, 30],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [8, 3, 4, 9, 28, 57],
     "node": ["爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["海龜科", "海洋地質"], "path": [
    {"route": [8, 3, 1, 0, 31],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海龜科", "海洋儀器與觀測"], "path": [
    {"route": [8, 3, 1, 0, 31, 32],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海龜科", "海底地形"], "path": [
    {"route": [8, 3, 1, 0, 31, 33],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海龜科", "聲納"], "path": [
    {"route": [8, 3, 1, 0, 31, 32, 34],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海龜科", "深海鑽探"], "path": [
    {"route": [8, 3, 1, 0, 31, 32, 35],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海龜科", "溫鹽深儀"], "path": [
    {"route": [8, 3, 1, 0, 31, 32, 36],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海龜科", "海地地震儀"], "path": [
    {"route": [8, 3, 1, 0, 31, 32, 37],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海龜科", "洋底盆地"], "path": [
    {"route": [8, 3, 1, 0, 31, 33, 44],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海龜科", "中洋脊"], "path": [
    {"route": [8, 3, 1, 0, 31, 33, 45],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海龜科", "大陸邊緣"], "path": [
    {"route": [8, 3, 1, 0, 31, 33, 46],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["海龜科", "海溝"], "path": [
    {"route": [8, 3, 1, 0, 31, 33, 47],
     "node": ["爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鯨豚目", "食肉目"], "path": [
    {"route": [9, 10],
     "node": ["哺乳綱"]},
  ]},
  {"nodes": ["鯨豚目", "八目鰻"], "path": [
    {"route": [9, 4, 2, 5, 11],
     "node": ["哺乳綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["鯨豚目", "盲鰻"], "path": [
    {"route": [9, 4, 2, 5, 12],
     "node": ["哺乳綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["鯨豚目", "魟魚"], "path": [
    {"route": [9, 4, 2, 6, 13],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["鯨豚目", "白眼鯊"], "path": [
    {"route": [9, 4, 2, 6, 14],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["鯨豚目", "鯨鯊"], "path": [
    {"route": [9, 4, 2, 6, 15],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["鯨豚目", "飛魚"], "path": [
    {"route": [9, 10, 26, 56],
     "node": ["哺乳綱","食肉目","海獅科"]},
  ]},
  {"nodes": ["鯨豚目", "翻車魨"], "path": [
    {"route": [9, 4, 2, 7, 17],
     "node": ["哺乳綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨豚目", "鮭魚"], "path": [
    {"route": [9, 4, 2, 7, 18],
     "node": ["哺乳綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨豚目", "比目魚"], "path": [
    {"route": [9, 4, 2, 7, 19],
     "node": ["哺乳綱","脊椎動物","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨豚目", "綠蠵龜"], "path": [
    {"route": [9, 4, 3, 8, 20],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨豚目", "赤蠵龜"], "path": [
    {"route": [9, 4, 3, 8, 21],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨豚目", "欖蠵龜"], "path": [
    {"route": [9, 4, 3, 8, 22],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨豚目", "革龜"], "path": [
    {"route": [9, 4, 3, 8, 23],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨豚目", "玳瑁"], "path": [
    {"route": [9, 4, 3, 8, 24],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨豚目", "海豹科"], "path": [
    {"route": [9, 10, 25],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["鯨豚目", "海獅科"], "path": [
    {"route": [9, 10, 26],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["鯨豚目", "海象科"], "path": [
    {"route": [9, 10, 27],
     "node": ["哺乳綱","食肉目"]},
  ]},
  {"nodes": ["鯨豚目", "海豚科"], "path": [
    {"route": [28],
     "node": []},
  ]},
  {"nodes": ["鯨豚目", "鬚鯨"], "path": [
    {"route": [29],
     "node": []},
  ]},
  {"nodes": ["鯨豚目", "藍鯨"], "path": [
    {"route": [29, 30],
     "node": ["鬚鯨"]},
    {"route": [28, 57],
     "node": ["海豚科"]},
  ]},
  {"nodes": ["鯨豚目", "海洋地質"], "path": [
    {"route": [9, 4, 1, 0, 31],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["鯨豚目", "海洋儀器與觀測"], "path": [
    {"route": [9, 4, 1, 0, 31, 32],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鯨豚目", "海底地形"], "path": [
    {"route": [9, 4, 1, 0, 31, 33],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鯨豚目", "聲納"], "path": [
    {"route": [9, 4, 1, 0, 31, 32, 34],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["鯨豚目", "深海鑽探"], "path": [
    {"route": [9, 4, 1, 0, 31, 32, 35],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["鯨豚目", "溫鹽深儀"], "path": [
    {"route": [9, 4, 1, 0, 31, 32, 36],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["鯨豚目", "海地地震儀"], "path": [
    {"route": [9, 4, 1, 0, 31, 32, 37],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["鯨豚目", "洋底盆地"], "path": [
    {"route": [9, 4, 1, 0, 31, 33, 44],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鯨豚目", "中洋脊"], "path": [
    {"route": [9, 4, 1, 0, 31, 33, 45],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鯨豚目", "大陸邊緣"], "path": [
    {"route": [9, 4, 1, 0, 31, 33, 46],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鯨豚目", "海溝"], "path": [
    {"route": [9, 4, 1, 0, 31, 33, 47],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["食肉目", "八目鰻"], "path": [
    {"route": [10, 4, 2, 5, 11],
     "node": ["哺乳綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["食肉目", "盲鰻"], "path": [
    {"route": [10, 4, 2, 5, 12],
     "node": ["哺乳綱","脊椎動物","魚綱","無頷魚"]},
  ]},
  {"nodes": ["食肉目", "魟魚"], "path": [
    {"route": [10, 4, 2, 6, 13],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["食肉目", "白眼鯊"], "path": [
    {"route": [10, 4, 2, 6, 14],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["食肉目", "鯨鯊"], "path": [
    {"route": [10, 4, 2, 6, 15],
     "node": ["哺乳綱","脊椎動物","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["食肉目", "飛魚"], "path": [
    {"route": [26, 56],
     "node": ["海獅科"]},
  ]},
  {"nodes": ["食肉目", "翻車魨"], "path": [
    {"route": [26, 56, 16, 17],
     "node": ["海獅科","飛魚","條鰭魚"]},
  ]},
  {"nodes": ["食肉目", "鮭魚"], "path": [
    {"route": [26, 56, 16, 18],
     "node": ["海獅科","飛魚","條鰭魚"]},
  ]},
  {"nodes": ["食肉目", "比目魚"], "path": [
    {"route": [26, 56, 16, 19],
     "node": ["海獅科","飛魚","條鰭魚"]},
  ]},
  {"nodes": ["食肉目", "綠蠵龜"], "path": [
    {"route": [10, 4, 3, 8, 20],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["食肉目", "赤蠵龜"], "path": [
    {"route": [10, 4, 3, 8, 21],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["食肉目", "欖蠵龜"], "path": [
    {"route": [10, 4, 3, 8, 22],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["食肉目", "革龜"], "path": [
    {"route": [10, 4, 3, 8, 23],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["食肉目", "玳瑁"], "path": [
    {"route": [10, 4, 3, 8, 24],
     "node": ["哺乳綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["食肉目", "海豹科"], "path": [
    {"route": [25],
     "node": []},
  ]},
  {"nodes": ["食肉目", "海獅科"], "path": [
    {"route": [26],
     "node": []},
  ]},
  {"nodes": ["食肉目", "海象科"], "path": [
    {"route": [27],
     "node": []},
  ]},
  {"nodes": ["食肉目", "海豚科"], "path": [
    {"route": [10, 9, 28],
     "node": ["哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["食肉目", "鬚鯨"], "path": [
    {"route": [10, 9, 29],
     "node": ["哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["食肉目", "藍鯨"], "path": [
    {"route": [10, 9, 29, 30],
     "node": ["哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [10, 9, 28, 57],
     "node": ["哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["食肉目", "海洋地質"], "path": [
    {"route": [10, 4, 1, 0, 31],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["食肉目", "海洋儀器與觀測"], "path": [
    {"route": [10, 4, 1, 0, 31, 32],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["食肉目", "海底地形"], "path": [
    {"route": [10, 4, 1, 0, 31, 33],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["食肉目", "聲納"], "path": [
    {"route": [10, 4, 1, 0, 31, 32, 34],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["食肉目", "深海鑽探"], "path": [
    {"route": [10, 4, 1, 0, 31, 32, 35],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["食肉目", "溫鹽深儀"], "path": [
    {"route": [10, 4, 1, 0, 31, 32, 36],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["食肉目", "海地地震儀"], "path": [
    {"route": [10, 4, 1, 0, 31, 32, 37],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["食肉目", "洋底盆地"], "path": [
    {"route": [10, 4, 1, 0, 31, 33, 44],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["食肉目", "中洋脊"], "path": [
    {"route": [10, 4, 1, 0, 31, 33, 45],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["食肉目", "大陸邊緣"], "path": [
    {"route": [10, 4, 1, 0, 31, 33, 46],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["食肉目", "海溝"], "path": [
    {"route": [10, 4, 1, 0, 31, 33, 47],
     "node": ["哺乳綱","脊椎動物","海洋生物","海洋","海洋地質","海底地形"]},
  ]},
  {"nodes": ["八目鰻", "盲鰻"], "path": [
    {"route": [11, 12],
     "node": ["無頷魚"]},
  ]},
  {"nodes": ["八目鰻", "魟魚"], "path": [
    {"route": [11, 5, 6, 13],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["八目鰻", "白眼鯊"], "path": [
    {"route": [11, 5, 6, 14],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["八目鰻", "鯨鯊"], "path": [
    {"route": [11, 5, 6, 15],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["八目鰻", "飛魚"], "path": [
    {"route": [11, 5, 7, 16],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["八目鰻", "翻車魨"], "path": [
    {"route": [11, 5, 7, 17],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["八目鰻", "鮭魚"], "path": [
    {"route": [11, 5, 7, 18],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["八目鰻", "比目魚"], "path": [
    {"route": [11, 5, 7, 19],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["八目鰻", "綠蠵龜"], "path": [
    {"route": [11, 5, 2, 3, 8, 20],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["八目鰻", "赤蠵龜"], "path": [
    {"route": [11, 5, 2, 3, 8, 21],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["八目鰻", "欖蠵龜"], "path": [
    {"route": [11, 5, 2, 3, 8, 22],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["八目鰻", "革龜"], "path": [
    {"route": [11, 5, 2, 3, 8, 23],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["八目鰻", "玳瑁"], "path": [
    {"route": [11, 5, 2, 3, 8, 24],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["八目鰻", "海豹科"], "path": [
    {"route": [11, 5, 2, 4, 10, 25],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["八目鰻", "海獅科"], "path": [
    {"route": [11, 5, 7, 16, 56],
     "node": ["無頷魚","魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["八目鰻", "海象科"], "path": [
    {"route": [11, 5, 2, 4, 10, 27],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["八目鰻", "海豚科"], "path": [
    {"route": [11, 5, 2, 4, 9, 28],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["八目鰻", "鬚鯨"], "path": [
    {"route": [11, 5, 2, 4, 9, 29],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["八目鰻", "藍鯨"], "path": [
    {"route": [11, 5, 2, 4, 9, 29, 30],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [11, 5, 2, 4, 9, 28, 57],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["八目鰻", "海洋地質"], "path": [
    {"route": [11, 5, 2, 1, 0, 31],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["八目鰻", "海洋儀器與觀測"], "path": [
    {"route": [11, 5, 2, 1, 0, 31, 32],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["八目鰻", "海底地形"], "path": [
    {"route": [11, 5, 2, 1, 0, 31, 33],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["盲鰻", "魟魚"], "path": [
    {"route": [12, 5, 6, 13],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["盲鰻", "白眼鯊"], "path": [
    {"route": [12, 5, 6, 14],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["盲鰻", "鯨鯊"], "path": [
    {"route": [12, 5, 6, 15],
     "node": ["無頷魚","魚綱","軟骨魚"]},
  ]},
  {"nodes": ["盲鰻", "飛魚"], "path": [
    {"route": [12, 5, 7, 16],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["盲鰻", "翻車魨"], "path": [
    {"route": [12, 5, 7, 17],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["盲鰻", "鮭魚"], "path": [
    {"route": [12, 5, 7, 18],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["盲鰻", "比目魚"], "path": [
    {"route": [12, 5, 7, 19],
     "node": ["無頷魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["盲鰻", "綠蠵龜"], "path": [
    {"route": [12, 5, 2, 3, 8, 20],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["盲鰻", "赤蠵龜"], "path": [
    {"route": [12, 5, 2, 3, 8, 21],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["盲鰻", "欖蠵龜"], "path": [
    {"route": [12, 5, 2, 3, 8, 22],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["盲鰻", "革龜"], "path": [
    {"route": [12, 5, 2, 3, 8, 23],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["盲鰻", "玳瑁"], "path": [
    {"route": [12, 5, 2, 3, 8, 24],
     "node": ["無頷魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["盲鰻", "海豹科"], "path": [
    {"route": [12, 5, 2, 4, 10, 25],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["盲鰻", "海獅科"], "path": [
    {"route": [12, 5, 7, 16, 56],
     "node": ["無頷魚","魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["盲鰻", "海象科"], "path": [
    {"route": [12, 5, 2, 4, 10, 27],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["盲鰻", "海豚科"], "path": [
    {"route": [12, 5, 2, 4, 9, 28],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["盲鰻", "鬚鯨"], "path": [
    {"route": [12, 5, 2, 4, 9, 29],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["盲鰻", "藍鯨"], "path": [
    {"route": [12, 5, 2, 4, 9, 29, 30],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [12, 5, 2, 4, 9, 28, 57],
     "node": ["無頷魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["盲鰻", "海洋地質"], "path": [
    {"route": [12, 5, 2, 1, 0, 31],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["盲鰻", "海洋儀器與觀測"], "path": [
    {"route": [12, 5, 2, 1, 0, 31, 32],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["盲鰻", "海底地形"], "path": [
    {"route": [12, 5, 2, 1, 0, 31, 33],
     "node": ["無頷魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["魟魚", "白眼鯊"], "path": [
    {"route": [13, 14],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["魟魚", "鯨鯊"], "path": [
    {"route": [13, 15],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["魟魚", "飛魚"], "path": [
    {"route": [13, 6, 7, 16],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["魟魚", "翻車魨"], "path": [
    {"route": [13, 6, 7, 17],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["魟魚", "鮭魚"], "path": [
    {"route": [13, 6, 7, 18],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["魟魚", "比目魚"], "path": [
    {"route": [13, 6, 7, 19],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["魟魚", "綠蠵龜"], "path": [
    {"route": [13, 6, 2, 3, 8, 20],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魟魚", "赤蠵龜"], "path": [
    {"route": [13, 6, 2, 3, 8, 21],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魟魚", "欖蠵龜"], "path": [
    {"route": [13, 6, 2, 3, 8, 22],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魟魚", "革龜"], "path": [
    {"route": [13, 6, 2, 3, 8, 23],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魟魚", "玳瑁"], "path": [
    {"route": [13, 6, 2, 3, 8, 24],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["魟魚", "海豹科"], "path": [
    {"route": [13, 6, 2, 4, 10, 25],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["魟魚", "海獅科"], "path": [
    {"route": [13, 6, 7, 16, 56],
     "node": ["軟骨魚","魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["魟魚", "海象科"], "path": [
    {"route": [13, 6, 2, 4, 10, 27],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["魟魚", "海豚科"], "path": [
    {"route": [13, 6, 2, 4, 9, 28],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["魟魚", "鬚鯨"], "path": [
    {"route": [13, 6, 2, 4, 9, 29],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["魟魚", "藍鯨"], "path": [
    {"route": [13, 6, 2, 4, 9, 29, 30],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [13, 6, 2, 4, 9, 28, 57],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["魟魚", "海洋地質"], "path": [
    {"route": [13, 6, 2, 1, 0, 31],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["魟魚", "海洋儀器與觀測"], "path": [
    {"route": [13, 6, 2, 1, 0, 31, 32],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["魟魚", "海底地形"], "path": [
    {"route": [13, 6, 2, 1, 0, 31, 33],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["白眼鯊", "鯨鯊"], "path": [
    {"route": [14, 15],
     "node": ["軟骨魚"]},
  ]},
  {"nodes": ["白眼鯊", "飛魚"], "path": [
    {"route": [14, 6, 7, 16],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["白眼鯊", "翻車魨"], "path": [
    {"route": [14, 6, 7, 17],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["白眼鯊", "鮭魚"], "path": [
    {"route": [14, 6, 7, 18],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["白眼鯊", "比目魚"], "path": [
    {"route": [14, 6, 7, 19],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["白眼鯊", "綠蠵龜"], "path": [
    {"route": [14, 6, 2, 3, 8, 20],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["白眼鯊", "赤蠵龜"], "path": [
    {"route": [14, 6, 2, 3, 8, 21],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["白眼鯊", "欖蠵龜"], "path": [
    {"route": [14, 6, 2, 3, 8, 22],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["白眼鯊", "革龜"], "path": [
    {"route": [14, 6, 2, 3, 8, 23],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["白眼鯊", "玳瑁"], "path": [
    {"route": [14, 6, 2, 3, 8, 24],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["白眼鯊", "海豹科"], "path": [
    {"route": [14, 6, 2, 4, 10, 25],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["白眼鯊", "海獅科"], "path": [
    {"route": [14, 6, 7, 16, 56],
     "node": ["軟骨魚","魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["白眼鯊", "海象科"], "path": [
    {"route": [14, 6, 2, 4, 10, 27],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["白眼鯊", "海豚科"], "path": [
    {"route": [14, 6, 2, 4, 9, 28],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["白眼鯊", "鬚鯨"], "path": [
    {"route": [14, 6, 2, 4, 9, 29],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["白眼鯊", "藍鯨"], "path": [
    {"route": [14, 6, 2, 4, 9, 29, 30],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [14, 6, 2, 4, 9, 28, 57],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["白眼鯊", "海洋地質"], "path": [
    {"route": [14, 6, 2, 1, 0, 31],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["白眼鯊", "海洋儀器與觀測"], "path": [
    {"route": [14, 6, 2, 1, 0, 31, 32],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["白眼鯊", "海底地形"], "path": [
    {"route": [14, 6, 2, 1, 0, 31, 33],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鯨鯊", "飛魚"], "path": [
    {"route": [15, 6, 7, 16],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨鯊", "翻車魨"], "path": [
    {"route": [15, 6, 7, 17],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨鯊", "鮭魚"], "path": [
    {"route": [15, 6, 7, 18],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨鯊", "比目魚"], "path": [
    {"route": [15, 6, 7, 19],
     "node": ["軟骨魚","魚綱","條鰭魚"]},
  ]},
  {"nodes": ["鯨鯊", "綠蠵龜"], "path": [
    {"route": [15, 6, 2, 3, 8, 20],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨鯊", "赤蠵龜"], "path": [
    {"route": [15, 6, 2, 3, 8, 21],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨鯊", "欖蠵龜"], "path": [
    {"route": [15, 6, 2, 3, 8, 22],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨鯊", "革龜"], "path": [
    {"route": [15, 6, 2, 3, 8, 23],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨鯊", "玳瑁"], "path": [
    {"route": [15, 6, 2, 3, 8, 24],
     "node": ["軟骨魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鯨鯊", "海豹科"], "path": [
    {"route": [15, 6, 2, 4, 10, 25],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["鯨鯊", "海獅科"], "path": [
    {"route": [15, 6, 7, 16, 56],
     "node": ["軟骨魚","魚綱","條鰭魚","飛魚"]},
  ]},
  {"nodes": ["鯨鯊", "海象科"], "path": [
    {"route": [15, 6, 2, 4, 10, 27],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["鯨鯊", "海豚科"], "path": [
    {"route": [15, 6, 2, 4, 9, 28],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["鯨鯊", "鬚鯨"], "path": [
    {"route": [15, 6, 2, 4, 9, 29],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["鯨鯊", "藍鯨"], "path": [
    {"route": [15, 6, 2, 4, 9, 29, 30],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [15, 6, 2, 4, 9, 28, 57],
     "node": ["軟骨魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["鯨鯊", "海洋地質"], "path": [
    {"route": [15, 6, 2, 1, 0, 31],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["鯨鯊", "海洋儀器與觀測"], "path": [
    {"route": [15, 6, 2, 1, 0, 31, 32],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鯨鯊", "海底地形"], "path": [
    {"route": [15, 6, 2, 1, 0, 31, 33],
     "node": ["軟骨魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["飛魚", "翻車魨"], "path": [
    {"route": [16, 17],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["飛魚", "鮭魚"], "path": [
    {"route": [16, 18],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["飛魚", "比目魚"], "path": [
    {"route": [16, 19],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["飛魚", "綠蠵龜"], "path": [
    {"route": [16, 7, 2, 3, 8, 20],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["飛魚", "赤蠵龜"], "path": [
    {"route": [16, 7, 2, 3, 8, 21],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["飛魚", "欖蠵龜"], "path": [
    {"route": [16, 7, 2, 3, 8, 22],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["飛魚", "革龜"], "path": [
    {"route": [16, 7, 2, 3, 8, 23],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["飛魚", "玳瑁"], "path": [
    {"route": [16, 7, 2, 3, 8, 24],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["飛魚", "海豹科"], "path": [
    {"route": [56, 26, 25],
     "node": ["海獅科","食肉目"]},
  ]},
  {"nodes": ["飛魚", "海獅科"], "path": [
    {"route": [56],
     "node": []},
  ]},
  {"nodes": ["飛魚", "海象科"], "path": [
    {"route": [56, 26, 27],
     "node": ["海獅科","食肉目"]},
  ]},
  {"nodes": ["飛魚", "海豚科"], "path": [
    {"route": [56, 26, 10, 9, 28],
     "node": ["海獅科","食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["飛魚", "鬚鯨"], "path": [
    {"route": [56, 26, 10, 9, 29],
     "node": ["海獅科","食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["飛魚", "藍鯨"], "path": [
    {"route": [56, 26, 10, 9, 29, 30],
     "node": ["海獅科","食肉目","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [56, 26, 10, 9, 28, 57],
     "node": ["海獅科","食肉目","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["飛魚", "海洋地質"], "path": [
    {"route": [16, 7, 2, 1, 0, 31],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["飛魚", "海洋儀器與觀測"], "path": [
    {"route": [16, 7, 2, 1, 0, 31, 32],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["飛魚", "海底地形"], "path": [
    {"route": [16, 7, 2, 1, 0, 31, 33],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["翻車魨", "鮭魚"], "path": [
    {"route": [17, 18],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["翻車魨", "比目魚"], "path": [
    {"route": [17, 19],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["翻車魨", "綠蠵龜"], "path": [
    {"route": [17, 7, 2, 3, 8, 20],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["翻車魨", "赤蠵龜"], "path": [
    {"route": [17, 7, 2, 3, 8, 21],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["翻車魨", "欖蠵龜"], "path": [
    {"route": [17, 7, 2, 3, 8, 22],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["翻車魨", "革龜"], "path": [
    {"route": [17, 7, 2, 3, 8, 23],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["翻車魨", "玳瑁"], "path": [
    {"route": [17, 7, 2, 3, 8, 24],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["翻車魨", "海豹科"], "path": [
    {"route": [17, 16, 56, 26, 25],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["翻車魨", "海獅科"], "path": [
    {"route": [17, 16, 56],
     "node": ["條鰭魚","飛魚"]},
  ]},
  {"nodes": ["翻車魨", "海象科"], "path": [
    {"route": [17, 16, 56, 26, 27],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["翻車魨", "海豚科"], "path": [
    {"route": [17, 7, 2, 4, 9, 28],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["翻車魨", "鬚鯨"], "path": [
    {"route": [17, 7, 2, 4, 9, 29],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["翻車魨", "藍鯨"], "path": [
    {"route": [17, 7, 2, 4, 9, 29, 30],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [17, 7, 2, 4, 9, 28, 57],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["翻車魨", "海洋地質"], "path": [
    {"route": [17, 7, 2, 1, 0, 31],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["翻車魨", "海洋儀器與觀測"], "path": [
    {"route": [17, 7, 2, 1, 0, 31, 32],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["翻車魨", "海底地形"], "path": [
    {"route": [17, 7, 2, 1, 0, 31, 33],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鮭魚", "比目魚"], "path": [
    {"route": [18, 19],
     "node": ["條鰭魚"]},
  ]},
  {"nodes": ["鮭魚", "綠蠵龜"], "path": [
    {"route": [18, 7, 2, 3, 8, 20],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鮭魚", "赤蠵龜"], "path": [
    {"route": [18, 7, 2, 3, 8, 21],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鮭魚", "欖蠵龜"], "path": [
    {"route": [18, 7, 2, 3, 8, 22],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鮭魚", "革龜"], "path": [
    {"route": [18, 7, 2, 3, 8, 23],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鮭魚", "玳瑁"], "path": [
    {"route": [18, 7, 2, 3, 8, 24],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["鮭魚", "海豹科"], "path": [
    {"route": [18, 16, 56, 26, 25],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["鮭魚", "海獅科"], "path": [
    {"route": [18, 16, 56],
     "node": ["條鰭魚","飛魚"]},
  ]},
  {"nodes": ["鮭魚", "海象科"], "path": [
    {"route": [18, 16, 56, 26, 27],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["鮭魚", "海豚科"], "path": [
    {"route": [18, 7, 2, 4, 9, 28],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["鮭魚", "鬚鯨"], "path": [
    {"route": [18, 7, 2, 4, 9, 29],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["鮭魚", "藍鯨"], "path": [
    {"route": [18, 7, 2, 4, 9, 29, 30],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [18, 7, 2, 4, 9, 28, 57],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["鮭魚", "海洋地質"], "path": [
    {"route": [18, 7, 2, 1, 0, 31],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["鮭魚", "海洋儀器與觀測"], "path": [
    {"route": [18, 7, 2, 1, 0, 31, 32],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鮭魚", "海底地形"], "path": [
    {"route": [18, 7, 2, 1, 0, 31, 33],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["比目魚", "綠蠵龜"], "path": [
    {"route": [19, 7, 2, 3, 8, 20],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["比目魚", "赤蠵龜"], "path": [
    {"route": [19, 7, 2, 3, 8, 21],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["比目魚", "欖蠵龜"], "path": [
    {"route": [19, 7, 2, 3, 8, 22],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["比目魚", "革龜"], "path": [
    {"route": [19, 7, 2, 3, 8, 23],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["比目魚", "玳瑁"], "path": [
    {"route": [19, 7, 2, 3, 8, 24],
     "node": ["條鰭魚","魚綱","脊椎動物","爬蟲綱","海龜科"]},
  ]},
  {"nodes": ["比目魚", "海豹科"], "path": [
    {"route": [19, 16, 56, 26, 25],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["比目魚", "海獅科"], "path": [
    {"route": [19, 16, 56],
     "node": ["條鰭魚","飛魚"]},
  ]},
  {"nodes": ["比目魚", "海象科"], "path": [
    {"route": [19, 16, 56, 26, 27],
     "node": ["條鰭魚","飛魚","海獅科","食肉目"]},
  ]},
  {"nodes": ["比目魚", "海豚科"], "path": [
    {"route": [19, 7, 2, 4, 9, 28],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["比目魚", "鬚鯨"], "path": [
    {"route": [19, 7, 2, 4, 9, 29],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["比目魚", "藍鯨"], "path": [
    {"route": [19, 7, 2, 4, 9, 29, 30],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [19, 7, 2, 4, 9, 28, 57],
     "node": ["條鰭魚","魚綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["比目魚", "海洋地質"], "path": [
    {"route": [19, 7, 2, 1, 0, 31],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["比目魚", "海洋儀器與觀測"], "path": [
    {"route": [19, 7, 2, 1, 0, 31, 32],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["比目魚", "海底地形"], "path": [
    {"route": [19, 7, 2, 1, 0, 31, 33],
     "node": ["條鰭魚","魚綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["綠蠵龜", "赤蠵龜"], "path": [
    {"route": [20, 21],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["綠蠵龜", "欖蠵龜"], "path": [
    {"route": [20, 22],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["綠蠵龜", "革龜"], "path": [
    {"route": [20, 23],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["綠蠵龜", "玳瑁"], "path": [
    {"route": [20, 24],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["綠蠵龜", "海豹科"], "path": [
    {"route": [20, 8, 3, 4, 10, 25],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["綠蠵龜", "海獅科"], "path": [
    {"route": [20, 8, 3, 4, 10, 26],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["綠蠵龜", "海象科"], "path": [
    {"route": [20, 8, 3, 4, 10, 27],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["綠蠵龜", "海豚科"], "path": [
    {"route": [20, 8, 3, 4, 9, 28],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["綠蠵龜", "鬚鯨"], "path": [
    {"route": [20, 8, 3, 4, 9, 29],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["綠蠵龜", "藍鯨"], "path": [
    {"route": [20, 8, 3, 4, 9, 29, 30],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [20, 8, 3, 4, 9, 28, 57],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["綠蠵龜", "海洋地質"], "path": [
    {"route": [20, 8, 3, 1, 0, 31],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["綠蠵龜", "海洋儀器與觀測"], "path": [
    {"route": [20, 8, 3, 1, 0, 31, 32],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["綠蠵龜", "海底地形"], "path": [
    {"route": [20, 8, 3, 1, 0, 31, 33],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["赤蠵龜", "欖蠵龜"], "path": [
    {"route": [21, 22],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["赤蠵龜", "革龜"], "path": [
    {"route": [21, 23],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["赤蠵龜", "玳瑁"], "path": [
    {"route": [21, 24],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["赤蠵龜", "海豹科"], "path": [
    {"route": [21, 8, 3, 4, 10, 25],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["赤蠵龜", "海獅科"], "path": [
    {"route": [21, 8, 3, 4, 10, 26],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["赤蠵龜", "海象科"], "path": [
    {"route": [21, 8, 3, 4, 10, 27],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["赤蠵龜", "海豚科"], "path": [
    {"route": [21, 8, 3, 4, 9, 28],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["赤蠵龜", "鬚鯨"], "path": [
    {"route": [21, 8, 3, 4, 9, 29],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["赤蠵龜", "藍鯨"], "path": [
    {"route": [21, 8, 3, 4, 9, 29, 30],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [21, 8, 3, 4, 9, 28, 57],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["赤蠵龜", "海洋地質"], "path": [
    {"route": [21, 8, 3, 1, 0, 31],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["赤蠵龜", "海洋儀器與觀測"], "path": [
    {"route": [21, 8, 3, 1, 0, 31, 32],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["赤蠵龜", "海底地形"], "path": [
    {"route": [21, 8, 3, 1, 0, 31, 33],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["欖蠵龜", "革龜"], "path": [
    {"route": [22, 23],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["欖蠵龜", "玳瑁"], "path": [
    {"route": [22, 24],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["欖蠵龜", "海豹科"], "path": [
    {"route": [22, 8, 3, 4, 10, 25],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["欖蠵龜", "海獅科"], "path": [
    {"route": [22, 8, 3, 4, 10, 26],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["欖蠵龜", "海象科"], "path": [
    {"route": [22, 8, 3, 4, 10, 27],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["欖蠵龜", "海豚科"], "path": [
    {"route": [22, 8, 3, 4, 9, 28],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["欖蠵龜", "鬚鯨"], "path": [
    {"route": [22, 8, 3, 4, 9, 29],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["欖蠵龜", "藍鯨"], "path": [
    {"route": [22, 8, 3, 4, 9, 29, 30],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [22, 8, 3, 4, 9, 28, 57],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["欖蠵龜", "海洋地質"], "path": [
    {"route": [22, 8, 3, 1, 0, 31],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["欖蠵龜", "海洋儀器與觀測"], "path": [
    {"route": [22, 8, 3, 1, 0, 31, 32],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["欖蠵龜", "海底地形"], "path": [
    {"route": [22, 8, 3, 1, 0, 31, 33],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["革龜", "玳瑁"], "path": [
    {"route": [23, 24],
     "node": ["海龜科"]},
  ]},
  {"nodes": ["革龜", "海豹科"], "path": [
    {"route": [23, 8, 3, 4, 10, 25],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["革龜", "海獅科"], "path": [
    {"route": [23, 8, 3, 4, 10, 26],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["革龜", "海象科"], "path": [
    {"route": [23, 8, 3, 4, 10, 27],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["革龜", "海豚科"], "path": [
    {"route": [23, 8, 3, 4, 9, 28],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["革龜", "鬚鯨"], "path": [
    {"route": [23, 8, 3, 4, 9, 29],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["革龜", "藍鯨"], "path": [
    {"route": [23, 8, 3, 4, 9, 29, 30],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [23, 8, 3, 4, 9, 28, 57],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["革龜", "海洋地質"], "path": [
    {"route": [23, 8, 3, 1, 0, 31],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["革龜", "海洋儀器與觀測"], "path": [
    {"route": [23, 8, 3, 1, 0, 31, 32],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["革龜", "海底地形"], "path": [
    {"route": [23, 8, 3, 1, 0, 31, 33],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["玳瑁", "海豹科"], "path": [
    {"route": [24, 8, 3, 4, 10, 25],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["玳瑁", "海獅科"], "path": [
    {"route": [24, 8, 3, 4, 10, 26],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["玳瑁", "海象科"], "path": [
    {"route": [24, 8, 3, 4, 10, 27],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","食肉目"]},
  ]},
  {"nodes": ["玳瑁", "海豚科"], "path": [
    {"route": [24, 8, 3, 4, 9, 28],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["玳瑁", "鬚鯨"], "path": [
    {"route": [24, 8, 3, 4, 9, 29],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["玳瑁", "藍鯨"], "path": [
    {"route": [24, 8, 3, 4, 9, 29, 30],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [24, 8, 3, 4, 9, 28, 57],
     "node": ["海龜科","爬蟲綱","脊椎動物","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["玳瑁", "海洋地質"], "path": [
    {"route": [24, 8, 3, 1, 0, 31],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["玳瑁", "海洋儀器與觀測"], "path": [
    {"route": [24, 8, 3, 1, 0, 31, 32],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["玳瑁", "海底地形"], "path": [
    {"route": [24, 8, 3, 1, 0, 31, 33],
     "node": ["海龜科","爬蟲綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海豹科", "海獅科"], "path": [
    {"route": [25, 26],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["海豹科", "海象科"], "path": [
    {"route": [25, 27],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["海豹科", "海豚科"], "path": [
    {"route": [25, 10, 9, 28],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海豹科", "鬚鯨"], "path": [
    {"route": [25, 10, 9, 29],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海豹科", "藍鯨"], "path": [
    {"route": [25, 10, 9, 29, 30],
     "node": ["食肉目","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [25, 10, 9, 28, 57],
     "node": ["食肉目","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["海豹科", "海洋地質"], "path": [
    {"route": [25, 10, 4, 1, 0, 31],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海豹科", "海洋儀器與觀測"], "path": [
    {"route": [25, 10, 4, 1, 0, 31, 32],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海豹科", "海底地形"], "path": [
    {"route": [25, 10, 4, 1, 0, 31, 33],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海獅科", "海象科"], "path": [
    {"route": [26, 27],
     "node": ["食肉目"]},
  ]},
  {"nodes": ["海獅科", "海豚科"], "path": [
    {"route": [26, 10, 9, 28],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海獅科", "鬚鯨"], "path": [
    {"route": [26, 10, 9, 29],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海獅科", "藍鯨"], "path": [
    {"route": [26, 10, 9, 29, 30],
     "node": ["食肉目","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [26, 10, 9, 28, 57],
     "node": ["食肉目","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["海獅科", "海洋地質"], "path": [
    {"route": [26, 10, 4, 1, 0, 31],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海獅科", "海洋儀器與觀測"], "path": [
    {"route": [26, 10, 4, 1, 0, 31, 32],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海獅科", "海底地形"], "path": [
    {"route": [26, 10, 4, 1, 0, 31, 33],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海象科", "海豚科"], "path": [
    {"route": [27, 10, 9, 28],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海象科", "鬚鯨"], "path": [
    {"route": [27, 10, 9, 29],
     "node": ["食肉目","哺乳綱","鯨豚目"]},
  ]},
  {"nodes": ["海象科", "藍鯨"], "path": [
    {"route": [27, 10, 9, 29, 30],
     "node": ["食肉目","哺乳綱","鯨豚目","鬚鯨"]},
    {"route": [27, 10, 9, 28, 57],
     "node": ["食肉目","哺乳綱","鯨豚目","海豚科"]},
  ]},
  {"nodes": ["海象科", "海洋地質"], "path": [
    {"route": [27, 10, 4, 1, 0, 31],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海象科", "海洋儀器與觀測"], "path": [
    {"route": [27, 10, 4, 1, 0, 31, 32],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海象科", "海底地形"], "path": [
    {"route": [27, 10, 4, 1, 0, 31, 33],
     "node": ["食肉目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海豚科", "鬚鯨"], "path": [
    {"route": [28, 29],
     "node": ["鯨豚目"]},
    {"route": [57, 30],
     "node": ["藍鯨"]},
  ]},
  {"nodes": ["海豚科", "藍鯨"], "path": [
    {"route": [57],
     "node": []},
  ]},
  {"nodes": ["海豚科", "海洋地質"], "path": [
    {"route": [28, 9, 4, 1, 0, 31],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海豚科", "海洋儀器與觀測"], "path": [
    {"route": [28, 9, 4, 1, 0, 31, 32],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["海豚科", "海底地形"], "path": [
    {"route": [28, 9, 4, 1, 0, 31, 33],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鬚鯨", "藍鯨"], "path": [
    {"route": [30],
     "node": []},
  ]},
  {"nodes": ["鬚鯨", "海洋地質"], "path": [
    {"route": [29, 9, 4, 1, 0, 31],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["鬚鯨", "海洋儀器與觀測"], "path": [
    {"route": [29, 9, 4, 1, 0, 31, 32],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["鬚鯨", "海底地形"], "path": [
    {"route": [29, 9, 4, 1, 0, 31, 33],
     "node": ["鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋","海洋地質"]},
  ]},
  {"nodes": ["藍鯨", "海洋地質"], "path": [
    {"route": [57, 28, 9, 4, 1, 0, 31],
     "node": ["海豚科","鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋"]},
    {"route": [30, 29, 9, 4, 1, 0, 31],
     "node": ["鬚鯨","鯨豚目","哺乳綱","脊椎動物","海洋生物","海洋"]},
  ]},
  {"nodes": ["海洋地質", "海洋儀器與觀測"], "path": [
    {"route": [32],
     "node": []},
  ]},
  {"nodes": ["海洋地質", "海底地形"], "path": [
    {"route": [33],
     "node": []},
  ]},
  {"nodes": ["海洋地質", "聲納"], "path": [
    {"route": [32, 34],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋地質", "深海鑽探"], "path": [
    {"route": [32, 35],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋地質", "溫鹽深儀"], "path": [
    {"route": [32, 36],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋地質", "海地地震儀"], "path": [
    {"route": [32, 37],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["海洋地質", "古氣候"], "path": [
    {"route": [32, 35, 38],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋地質", "古海洋"], "path": [
    {"route": [32, 35, 39],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋地質", "鹽度"], "path": [
    {"route": [32, 36, 40],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋地質", "溫度"], "path": [
    {"route": [32, 36, 41],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋地質", "深度"], "path": [
    {"route": [32, 36, 42],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [32, 34, 58],
     "node": ["海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["海洋地質", "地震"], "path": [
    {"route": [32, 37, 43],
     "node": ["海洋儀器與觀測","海地地震儀"]},
    {"route": [33, 47, 59],
     "node": ["海底地形","海溝"]},
    {"route": [33, 45, 60],
     "node": ["海底地形","中洋脊"]},
  ]},
  {"nodes": ["海洋地質", "洋底盆地"], "path": [
    {"route": [33, 44],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["海洋地質", "中洋脊"], "path": [
    {"route": [33, 45],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["海洋地質", "大陸邊緣"], "path": [
    {"route": [33, 46],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["海洋地質", "海溝"], "path": [
    {"route": [33, 47],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["海洋地質", "水團"], "path": [
    {"route": [32, 36, 48],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋地質", "海底山"], "path": [
    {"route": [33, 44, 49],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋地質", "深海平原"], "path": [
    {"route": [33, 44, 50],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋地質", "玄武岩"], "path": [
    {"route": [32, 35, 51],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海洋地質", "大陸坡"], "path": [
    {"route": [32, 36, 52],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋地質", "大陸棚"], "path": [
    {"route": [32, 36, 53],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海洋地質", "生產力高"], "path": [
    {"route": [32, 36, 53, 54],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海洋地質", "多樣性高"], "path": [
    {"route": [32, 36, 53, 55],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "海底地形"], "path": [
    {"route": [32, 33],
     "node": ["海洋地質"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "聲納"], "path": [
    {"route": [34],
     "node": []},
  ]},
  {"nodes": ["海洋儀器與觀測", "深海鑽探"], "path": [
    {"route": [35],
     "node": []},
  ]},
  {"nodes": ["海洋儀器與觀測", "溫鹽深儀"], "path": [
    {"route": [36],
     "node": []},
  ]},
  {"nodes": ["海洋儀器與觀測", "海地地震儀"], "path": [
    {"route": [37],
     "node": []},
  ]},
  {"nodes": ["海洋儀器與觀測", "古氣候"], "path": [
    {"route": [35, 38],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "古海洋"], "path": [
    {"route": [35, 39],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "鹽度"], "path": [
    {"route": [36, 40],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "溫度"], "path": [
    {"route": [36, 41],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "深度"], "path": [
    {"route": [36, 42],
     "node": ["溫鹽深儀"]},
    {"route": [34, 58],
     "node": ["聲納"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "地震"], "path": [
    {"route": [37, 43],
     "node": ["海地地震儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "洋底盆地"], "path": [
    {"route": [32, 33, 44],
     "node": ["海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "中洋脊"], "path": [
    {"route": [32, 33, 45],
     "node": ["海洋地質","海底地形"]},
    {"route": [37, 43, 60],
     "node": ["海地地震儀","地震"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "大陸邊緣"], "path": [
    {"route": [32, 33, 46],
     "node": ["海洋地質","海底地形"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "海溝"], "path": [
    {"route": [32, 33, 47],
     "node": ["海洋地質","海底地形"]},
    {"route": [37, 43, 59],
     "node": ["海地地震儀","地震"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "水團"], "path": [
    {"route": [36, 48],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "海底山"], "path": [
    {"route": [32, 33, 44, 49],
     "node": ["海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "深海平原"], "path": [
    {"route": [32, 33, 44, 50],
     "node": ["海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "玄武岩"], "path": [
    {"route": [35, 51],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "大陸坡"], "path": [
    {"route": [36, 52],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "大陸棚"], "path": [
    {"route": [36, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "生產力高"], "path": [
    {"route": [36, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海洋儀器與觀測", "多樣性高"], "path": [
    {"route": [36, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海底地形", "聲納"], "path": [
    {"route": [33, 32, 34],
     "node": ["海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海底地形", "深海鑽探"], "path": [
    {"route": [33, 32, 35],
     "node": ["海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海底地形", "溫鹽深儀"], "path": [
    {"route": [33, 32, 36],
     "node": ["海洋地質","海洋儀器與觀測"]},
  ]},
  {"nodes": ["海底地形", "海地地震儀"], "path": [
    {"route": [33, 32, 37],
     "node": ["海洋地質","海洋儀器與觀測"]},
    {"route": [47, 59, 43],
     "node": ["海溝","地震"]},
    {"route": [45, 60, 43],
     "node": ["中洋脊","地震"]},
  ]},
  {"nodes": ["海底地形", "古氣候"], "path": [
    {"route": [33, 32, 35, 38],
     "node": ["海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海底地形", "古海洋"], "path": [
    {"route": [33, 32, 35, 39],
     "node": ["海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海底地形", "鹽度"], "path": [
    {"route": [33, 32, 36, 40],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底地形", "溫度"], "path": [
    {"route": [33, 32, 36, 41],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底地形", "深度"], "path": [
    {"route": [33, 32, 36, 42],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [33, 32, 34, 58],
     "node": ["海洋地質","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["海底地形", "地震"], "path": [
    {"route": [47, 59],
     "node": ["海溝"]},
    {"route": [45, 60],
     "node": ["中洋脊"]},
  ]},
  {"nodes": ["海底地形", "洋底盆地"], "path": [
    {"route": [44],
     "node": []},
  ]},
  {"nodes": ["海底地形", "中洋脊"], "path": [
    {"route": [45],
     "node": []},
  ]},
  {"nodes": ["海底地形", "大陸邊緣"], "path": [
    {"route": [46],
     "node": []},
  ]},
  {"nodes": ["海底地形", "海溝"], "path": [
    {"route": [47],
     "node": []},
  ]},
  {"nodes": ["海底地形", "水團"], "path": [
    {"route": [33, 32, 36, 48],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底地形", "海底山"], "path": [
    {"route": [44, 49],
     "node": ["洋底盆地"]},
  ]},
  {"nodes": ["海底地形", "深海平原"], "path": [
    {"route": [44, 50],
     "node": ["洋底盆地"]},
  ]},
  {"nodes": ["海底地形", "玄武岩"], "path": [
    {"route": [33, 32, 35, 51],
     "node": ["海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海底地形", "大陸坡"], "path": [
    {"route": [33, 32, 36, 52],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底地形", "大陸棚"], "path": [
    {"route": [33, 32, 36, 53],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底地形", "生產力高"], "path": [
    {"route": [33, 32, 36, 53, 54],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海底地形", "多樣性高"], "path": [
    {"route": [33, 32, 36, 53, 55],
     "node": ["海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["聲納", "深海鑽探"], "path": [
    {"route": [34, 35],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["聲納", "溫鹽深儀"], "path": [
    {"route": [34, 36],
     "node": ["海洋儀器與觀測"]},
    {"route": [58, 42],
     "node": ["深度"]},
  ]},
  {"nodes": ["聲納", "海地地震儀"], "path": [
    {"route": [34, 37],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["聲納", "古氣候"], "path": [
    {"route": [34, 35, 38],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["聲納", "古海洋"], "path": [
    {"route": [34, 35, 39],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["聲納", "鹽度"], "path": [
    {"route": [34, 36, 40],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [58, 42, 40],
     "node": ["深度","溫鹽深儀"]},
  ]},
  {"nodes": ["聲納", "溫度"], "path": [
    {"route": [34, 36, 41],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [58, 42, 41],
     "node": ["深度","溫鹽深儀"]},
  ]},
  {"nodes": ["聲納", "深度"], "path": [
    {"route": [58],
     "node": []},
  ]},
  {"nodes": ["聲納", "地震"], "path": [
    {"route": [34, 37, 43],
     "node": ["海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["聲納", "洋底盆地"], "path": [
    {"route": [34, 32, 33, 44],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["聲納", "中洋脊"], "path": [
    {"route": [34, 32, 33, 45],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [34, 37, 43, 60],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["聲納", "大陸邊緣"], "path": [
    {"route": [34, 32, 33, 46],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["聲納", "海溝"], "path": [
    {"route": [34, 32, 33, 47],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [34, 37, 43, 59],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["聲納", "水團"], "path": [
    {"route": [34, 36, 48],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [58, 42, 48],
     "node": ["深度","溫鹽深儀"]},
  ]},
  {"nodes": ["聲納", "海底山"], "path": [
    {"route": [34, 32, 33, 44, 49],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["聲納", "深海平原"], "path": [
    {"route": [34, 32, 33, 44, 50],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["聲納", "玄武岩"], "path": [
    {"route": [34, 35, 51],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["聲納", "大陸坡"], "path": [
    {"route": [34, 36, 52],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [58, 42, 52],
     "node": ["深度","溫鹽深儀"]},
  ]},
  {"nodes": ["聲納", "大陸棚"], "path": [
    {"route": [34, 36, 53],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [58, 42, 53],
     "node": ["深度","溫鹽深儀"]},
  ]},
  {"nodes": ["聲納", "生產力高"], "path": [
    {"route": [34, 36, 53, 54],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [58, 42, 53, 54],
     "node": ["深度","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["聲納", "多樣性高"], "path": [
    {"route": [34, 36, 53, 55],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [58, 42, 53, 55],
     "node": ["深度","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深海鑽探", "溫鹽深儀"], "path": [
    {"route": [35, 36],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["深海鑽探", "海地地震儀"], "path": [
    {"route": [35, 37],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["深海鑽探", "古氣候"], "path": [
    {"route": [38],
     "node": []},
  ]},
  {"nodes": ["深海鑽探", "古海洋"], "path": [
    {"route": [39],
     "node": []},
  ]},
  {"nodes": ["深海鑽探", "鹽度"], "path": [
    {"route": [35, 36, 40],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海鑽探", "溫度"], "path": [
    {"route": [35, 36, 41],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海鑽探", "深度"], "path": [
    {"route": [35, 36, 42],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [35, 34, 58],
     "node": ["海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["深海鑽探", "地震"], "path": [
    {"route": [35, 37, 43],
     "node": ["海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["深海鑽探", "洋底盆地"], "path": [
    {"route": [35, 32, 33, 44],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["深海鑽探", "中洋脊"], "path": [
    {"route": [35, 32, 33, 45],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [35, 37, 43, 60],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["深海鑽探", "大陸邊緣"], "path": [
    {"route": [35, 32, 33, 46],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["深海鑽探", "海溝"], "path": [
    {"route": [35, 32, 33, 47],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [35, 37, 43, 59],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["深海鑽探", "水團"], "path": [
    {"route": [35, 36, 48],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海鑽探", "海底山"], "path": [
    {"route": [35, 32, 33, 44, 49],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["深海鑽探", "深海平原"], "path": [
    {"route": [35, 32, 33, 44, 50],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["深海鑽探", "玄武岩"], "path": [
    {"route": [51],
     "node": []},
  ]},
  {"nodes": ["深海鑽探", "大陸坡"], "path": [
    {"route": [35, 36, 52],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海鑽探", "大陸棚"], "path": [
    {"route": [35, 36, 53],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海鑽探", "生產力高"], "path": [
    {"route": [35, 36, 53, 54],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深海鑽探", "多樣性高"], "path": [
    {"route": [35, 36, 53, 55],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["溫鹽深儀", "海地地震儀"], "path": [
    {"route": [36, 37],
     "node": ["海洋儀器與觀測"]},
  ]},
  {"nodes": ["溫鹽深儀", "古氣候"], "path": [
    {"route": [36, 35, 38],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["溫鹽深儀", "古海洋"], "path": [
    {"route": [36, 35, 39],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["溫鹽深儀", "鹽度"], "path": [
    {"route": [40],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "溫度"], "path": [
    {"route": [41],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "深度"], "path": [
    {"route": [42],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "地震"], "path": [
    {"route": [36, 37, 43],
     "node": ["海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["溫鹽深儀", "洋底盆地"], "path": [
    {"route": [36, 32, 33, 44],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["溫鹽深儀", "中洋脊"], "path": [
    {"route": [36, 32, 33, 45],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [36, 37, 43, 60],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["溫鹽深儀", "大陸邊緣"], "path": [
    {"route": [36, 32, 33, 46],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["溫鹽深儀", "海溝"], "path": [
    {"route": [36, 32, 33, 47],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [36, 37, 43, 59],
     "node": ["海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["溫鹽深儀", "水團"], "path": [
    {"route": [48],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "海底山"], "path": [
    {"route": [36, 32, 33, 44, 49],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["溫鹽深儀", "深海平原"], "path": [
    {"route": [36, 32, 33, 44, 50],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["溫鹽深儀", "玄武岩"], "path": [
    {"route": [36, 35, 51],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["溫鹽深儀", "大陸坡"], "path": [
    {"route": [52],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "大陸棚"], "path": [
    {"route": [53],
     "node": []},
  ]},
  {"nodes": ["溫鹽深儀", "生產力高"], "path": [
    {"route": [53, 54],
     "node": ["大陸棚"]},
  ]},
  {"nodes": ["溫鹽深儀", "多樣性高"], "path": [
    {"route": [53, 55],
     "node": ["大陸棚"]},
  ]},
  {"nodes": ["海地地震儀", "古氣候"], "path": [
    {"route": [37, 35, 38],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海地地震儀", "古海洋"], "path": [
    {"route": [37, 35, 39],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海地地震儀", "鹽度"], "path": [
    {"route": [37, 36, 40],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海地地震儀", "溫度"], "path": [
    {"route": [37, 36, 41],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海地地震儀", "深度"], "path": [
    {"route": [37, 36, 42],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
    {"route": [37, 34, 58],
     "node": ["海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["海地地震儀", "地震"], "path": [
    {"route": [43],
     "node": []},
  ]},
  {"nodes": ["海地地震儀", "洋底盆地"], "path": [
    {"route": [37, 32, 33, 44],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [43, 60, 45, 44],
     "node": ["地震","中洋脊","海底地形"]},
    {"route": [43, 59, 47, 44],
     "node": ["地震","海溝","海底地形"]},
  ]},
  {"nodes": ["海地地震儀", "中洋脊"], "path": [
    {"route": [43, 60],
     "node": ["地震"]},
  ]},
  {"nodes": ["海地地震儀", "大陸邊緣"], "path": [
    {"route": [37, 32, 33, 46],
     "node": ["海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [43, 60, 45, 46],
     "node": ["地震","中洋脊","海底地形"]},
    {"route": [43, 59, 47, 46],
     "node": ["地震","海溝","海底地形"]},
  ]},
  {"nodes": ["海地地震儀", "海溝"], "path": [
    {"route": [43, 59],
     "node": ["地震"]},
  ]},
  {"nodes": ["海地地震儀", "水團"], "path": [
    {"route": [37, 36, 48],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海地地震儀", "海底山"], "path": [
    {"route": [37, 32, 33, 44, 49],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
    {"route": [43, 60, 45, 44, 49],
     "node": ["地震","中洋脊","海底地形","洋底盆地"]},
    {"route": [43, 59, 47, 44, 49],
     "node": ["地震","海溝","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海地地震儀", "深海平原"], "path": [
    {"route": [37, 32, 33, 44, 50],
     "node": ["海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
    {"route": [43, 60, 45, 44, 50],
     "node": ["地震","中洋脊","海底地形","洋底盆地"]},
    {"route": [43, 59, 47, 44, 50],
     "node": ["地震","海溝","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海地地震儀", "玄武岩"], "path": [
    {"route": [37, 35, 51],
     "node": ["海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海地地震儀", "大陸坡"], "path": [
    {"route": [37, 36, 52],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海地地震儀", "大陸棚"], "path": [
    {"route": [37, 36, 53],
     "node": ["海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海地地震儀", "生產力高"], "path": [
    {"route": [37, 36, 53, 54],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海地地震儀", "多樣性高"], "path": [
    {"route": [37, 36, 53, 55],
     "node": ["海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["古氣候", "古海洋"], "path": [
    {"route": [38, 39],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["古氣候", "鹽度"], "path": [
    {"route": [38, 35, 36, 40],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古氣候", "溫度"], "path": [
    {"route": [38, 35, 36, 41],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古氣候", "深度"], "path": [
    {"route": [38, 35, 36, 42],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [38, 35, 34, 58],
     "node": ["深海鑽探","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["古氣候", "地震"], "path": [
    {"route": [38, 35, 37, 43],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["古氣候", "洋底盆地"], "path": [
    {"route": [38, 35, 32, 33, 44],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["古氣候", "中洋脊"], "path": [
    {"route": [38, 35, 32, 33, 45],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [38, 35, 37, 43, 60],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["古氣候", "大陸邊緣"], "path": [
    {"route": [38, 35, 32, 33, 46],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["古氣候", "海溝"], "path": [
    {"route": [38, 35, 32, 33, 47],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [38, 35, 37, 43, 59],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["古氣候", "水團"], "path": [
    {"route": [38, 35, 36, 48],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古氣候", "海底山"], "path": [
    {"route": [38, 35, 32, 33, 44, 49],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["古氣候", "深海平原"], "path": [
    {"route": [38, 35, 32, 33, 44, 50],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["古氣候", "玄武岩"], "path": [
    {"route": [38, 51],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["古氣候", "大陸坡"], "path": [
    {"route": [38, 35, 36, 52],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古氣候", "大陸棚"], "path": [
    {"route": [38, 35, 36, 53],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古氣候", "生產力高"], "path": [
    {"route": [38, 35, 36, 53, 54],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["古氣候", "多樣性高"], "path": [
    {"route": [38, 35, 36, 53, 55],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["古海洋", "鹽度"], "path": [
    {"route": [39, 35, 36, 40],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古海洋", "溫度"], "path": [
    {"route": [39, 35, 36, 41],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古海洋", "深度"], "path": [
    {"route": [39, 35, 36, 42],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [39, 35, 34, 58],
     "node": ["深海鑽探","海洋儀器與觀測","聲納"]},
  ]},
  {"nodes": ["古海洋", "地震"], "path": [
    {"route": [39, 35, 37, 43],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["古海洋", "洋底盆地"], "path": [
    {"route": [39, 35, 32, 33, 44],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["古海洋", "中洋脊"], "path": [
    {"route": [39, 35, 32, 33, 45],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [39, 35, 37, 43, 60],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["古海洋", "大陸邊緣"], "path": [
    {"route": [39, 35, 32, 33, 46],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["古海洋", "海溝"], "path": [
    {"route": [39, 35, 32, 33, 47],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [39, 35, 37, 43, 59],
     "node": ["深海鑽探","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["古海洋", "水團"], "path": [
    {"route": [39, 35, 36, 48],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古海洋", "海底山"], "path": [
    {"route": [39, 35, 32, 33, 44, 49],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["古海洋", "深海平原"], "path": [
    {"route": [39, 35, 32, 33, 44, 50],
     "node": ["深海鑽探","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["古海洋", "玄武岩"], "path": [
    {"route": [39, 51],
     "node": ["深海鑽探"]},
  ]},
  {"nodes": ["古海洋", "大陸坡"], "path": [
    {"route": [39, 35, 36, 52],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古海洋", "大陸棚"], "path": [
    {"route": [39, 35, 36, 53],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["古海洋", "生產力高"], "path": [
    {"route": [39, 35, 36, 53, 54],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["古海洋", "多樣性高"], "path": [
    {"route": [39, 35, 36, 53, 55],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["鹽度", "溫度"], "path": [
    {"route": [40, 41],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["鹽度", "深度"], "path": [
    {"route": [40, 42],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["鹽度", "地震"], "path": [
    {"route": [40, 36, 37, 43],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["鹽度", "洋底盆地"], "path": [
    {"route": [40, 36, 32, 33, 44],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鹽度", "中洋脊"], "path": [
    {"route": [40, 36, 32, 33, 45],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [40, 36, 37, 43, 60],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["鹽度", "大陸邊緣"], "path": [
    {"route": [40, 36, 32, 33, 46],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["鹽度", "海溝"], "path": [
    {"route": [40, 36, 32, 33, 47],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [40, 36, 37, 43, 59],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["鹽度", "水團"], "path": [
    {"route": [40, 48],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["鹽度", "海底山"], "path": [
    {"route": [40, 36, 32, 33, 44, 49],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["鹽度", "深海平原"], "path": [
    {"route": [40, 36, 32, 33, 44, 50],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["鹽度", "玄武岩"], "path": [
    {"route": [40, 36, 35, 51],
     "node": ["溫鹽深儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["鹽度", "大陸坡"], "path": [
    {"route": [40, 52],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["鹽度", "大陸棚"], "path": [
    {"route": [40, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["鹽度", "生產力高"], "path": [
    {"route": [40, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["鹽度", "多樣性高"], "path": [
    {"route": [40, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["溫度", "深度"], "path": [
    {"route": [41, 42],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["溫度", "地震"], "path": [
    {"route": [41, 36, 37, 43],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["溫度", "洋底盆地"], "path": [
    {"route": [41, 36, 32, 33, 44],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["溫度", "中洋脊"], "path": [
    {"route": [41, 36, 32, 33, 45],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [41, 36, 37, 43, 60],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["溫度", "大陸邊緣"], "path": [
    {"route": [41, 36, 32, 33, 46],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["溫度", "海溝"], "path": [
    {"route": [41, 36, 32, 33, 47],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [41, 36, 37, 43, 59],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["溫度", "水團"], "path": [
    {"route": [41, 48],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["溫度", "海底山"], "path": [
    {"route": [41, 36, 32, 33, 44, 49],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["溫度", "深海平原"], "path": [
    {"route": [41, 36, 32, 33, 44, 50],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["溫度", "玄武岩"], "path": [
    {"route": [41, 36, 35, 51],
     "node": ["溫鹽深儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["溫度", "大陸坡"], "path": [
    {"route": [41, 52],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["溫度", "大陸棚"], "path": [
    {"route": [41, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["溫度", "生產力高"], "path": [
    {"route": [41, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["溫度", "多樣性高"], "path": [
    {"route": [41, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深度", "地震"], "path": [
    {"route": [58, 34, 37, 43],
     "node": ["聲納","海洋儀器與觀測","海地地震儀"]},
    {"route": [42, 36, 37, 43],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀"]},
  ]},
  {"nodes": ["深度", "洋底盆地"], "path": [
    {"route": [58, 34, 32, 33, 44],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [42, 36, 32, 33, 44],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["深度", "中洋脊"], "path": [
    {"route": [58, 34, 32, 33, 45],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [42, 36, 32, 33, 45],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [58, 34, 37, 43, 60],
     "node": ["聲納","海洋儀器與觀測","海地地震儀","地震"]},
    {"route": [42, 36, 37, 43, 60],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["深度", "大陸邊緣"], "path": [
    {"route": [58, 34, 32, 33, 46],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [42, 36, 32, 33, 46],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
  ]},
  {"nodes": ["深度", "海溝"], "path": [
    {"route": [58, 34, 32, 33, 47],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [42, 36, 32, 33, 47],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形"]},
    {"route": [58, 34, 37, 43, 59],
     "node": ["聲納","海洋儀器與觀測","海地地震儀","地震"]},
    {"route": [42, 36, 37, 43, 59],
     "node": ["溫鹽深儀","海洋儀器與觀測","海地地震儀","地震"]},
  ]},
  {"nodes": ["深度", "水團"], "path": [
    {"route": [42, 48],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["深度", "海底山"], "path": [
    {"route": [58, 34, 32, 33, 44, 49],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
    {"route": [42, 36, 32, 33, 44, 49],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["深度", "深海平原"], "path": [
    {"route": [58, 34, 32, 33, 44, 50],
     "node": ["聲納","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
    {"route": [42, 36, 32, 33, 44, 50],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["深度", "玄武岩"], "path": [
    {"route": [58, 34, 35, 51],
     "node": ["聲納","海洋儀器與觀測","深海鑽探"]},
    {"route": [42, 36, 35, 51],
     "node": ["溫鹽深儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["深度", "大陸坡"], "path": [
    {"route": [42, 52],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["深度", "大陸棚"], "path": [
    {"route": [42, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["深度", "生產力高"], "path": [
    {"route": [42, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深度", "多樣性高"], "path": [
    {"route": [42, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["地震", "洋底盆地"], "path": [
    {"route": [60, 45, 44],
     "node": ["中洋脊","海底地形"]},
    {"route": [59, 47, 44],
     "node": ["海溝","海底地形"]},
  ]},
  {"nodes": ["地震", "中洋脊"], "path": [
    {"route": [60],
     "node": []},
  ]},
  {"nodes": ["地震", "大陸邊緣"], "path": [
    {"route": [60, 45, 46],
     "node": ["中洋脊","海底地形"]},
    {"route": [59, 47, 46],
     "node": ["海溝","海底地形"]},
  ]},
  {"nodes": ["地震", "海溝"], "path": [
    {"route": [59],
     "node": []},
  ]},
  {"nodes": ["地震", "水團"], "path": [
    {"route": [43, 37, 36, 48],
     "node": ["海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["地震", "海底山"], "path": [
    {"route": [60, 45, 44, 49],
     "node": ["中洋脊","海底地形","洋底盆地"]},
    {"route": [59, 47, 44, 49],
     "node": ["海溝","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["地震", "深海平原"], "path": [
    {"route": [60, 45, 44, 50],
     "node": ["中洋脊","海底地形","洋底盆地"]},
    {"route": [59, 47, 44, 50],
     "node": ["海溝","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["地震", "玄武岩"], "path": [
    {"route": [43, 37, 35, 51],
     "node": ["海地地震儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["地震", "大陸坡"], "path": [
    {"route": [43, 37, 36, 52],
     "node": ["海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["地震", "大陸棚"], "path": [
    {"route": [43, 37, 36, 53],
     "node": ["海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["地震", "生產力高"], "path": [
    {"route": [43, 37, 36, 53, 54],
     "node": ["海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["地震", "多樣性高"], "path": [
    {"route": [43, 37, 36, 53, 55],
     "node": ["海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["洋底盆地", "中洋脊"], "path": [
    {"route": [44, 45],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["洋底盆地", "大陸邊緣"], "path": [
    {"route": [44, 46],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["洋底盆地", "海溝"], "path": [
    {"route": [44, 47],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["洋底盆地", "水團"], "path": [
    {"route": [44, 33, 32, 36, 48],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["洋底盆地", "海底山"], "path": [
    {"route": [49],
     "node": []},
  ]},
  {"nodes": ["洋底盆地", "深海平原"], "path": [
    {"route": [50],
     "node": []},
  ]},
  {"nodes": ["洋底盆地", "玄武岩"], "path": [
    {"route": [44, 33, 32, 35, 51],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["洋底盆地", "大陸坡"], "path": [
    {"route": [44, 33, 32, 36, 52],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["洋底盆地", "大陸棚"], "path": [
    {"route": [44, 33, 32, 36, 53],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["洋底盆地", "生產力高"], "path": [
    {"route": [44, 33, 32, 36, 53, 54],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["洋底盆地", "多樣性高"], "path": [
    {"route": [44, 33, 32, 36, 53, 55],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["中洋脊", "大陸邊緣"], "path": [
    {"route": [45, 46],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["中洋脊", "海溝"], "path": [
    {"route": [45, 47],
     "node": ["海底地形"]},
    {"route": [60, 59],
     "node": ["地震"]},
  ]},
  {"nodes": ["中洋脊", "水團"], "path": [
    {"route": [45, 33, 32, 36, 48],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [60, 43, 37, 36, 48],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["中洋脊", "海底山"], "path": [
    {"route": [45, 44, 49],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["中洋脊", "深海平原"], "path": [
    {"route": [45, 44, 50],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["中洋脊", "玄武岩"], "path": [
    {"route": [45, 33, 32, 35, 51],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
    {"route": [60, 43, 37, 35, 51],
     "node": ["地震","海地地震儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["中洋脊", "大陸坡"], "path": [
    {"route": [45, 33, 32, 36, 52],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [60, 43, 37, 36, 52],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["中洋脊", "大陸棚"], "path": [
    {"route": [45, 33, 32, 36, 53],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [60, 43, 37, 36, 53],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["中洋脊", "生產力高"], "path": [
    {"route": [45, 33, 32, 36, 53, 54],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [60, 43, 37, 36, 53, 54],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["中洋脊", "多樣性高"], "path": [
    {"route": [45, 33, 32, 36, 53, 55],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [60, 43, 37, 36, 53, 55],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["大陸邊緣", "海溝"], "path": [
    {"route": [46, 47],
     "node": ["海底地形"]},
  ]},
  {"nodes": ["大陸邊緣", "水團"], "path": [
    {"route": [46, 33, 32, 36, 48],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["大陸邊緣", "海底山"], "path": [
    {"route": [46, 44, 49],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["大陸邊緣", "深海平原"], "path": [
    {"route": [46, 44, 50],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["大陸邊緣", "玄武岩"], "path": [
    {"route": [46, 33, 32, 35, 51],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["大陸邊緣", "大陸坡"], "path": [
    {"route": [46, 33, 32, 36, 52],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["大陸邊緣", "大陸棚"], "path": [
    {"route": [46, 33, 32, 36, 53],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["大陸邊緣", "生產力高"], "path": [
    {"route": [46, 33, 32, 36, 53, 54],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["大陸邊緣", "多樣性高"], "path": [
    {"route": [46, 33, 32, 36, 53, 55],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海溝", "水團"], "path": [
    {"route": [47, 33, 32, 36, 48],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [59, 43, 37, 36, 48],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海溝", "海底山"], "path": [
    {"route": [47, 44, 49],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海溝", "深海平原"], "path": [
    {"route": [47, 44, 50],
     "node": ["海底地形","洋底盆地"]},
  ]},
  {"nodes": ["海溝", "玄武岩"], "path": [
    {"route": [47, 33, 32, 35, 51],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
    {"route": [59, 43, 37, 35, 51],
     "node": ["地震","海地地震儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海溝", "大陸坡"], "path": [
    {"route": [47, 33, 32, 36, 52],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [59, 43, 37, 36, 52],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海溝", "大陸棚"], "path": [
    {"route": [47, 33, 32, 36, 53],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
    {"route": [59, 43, 37, 36, 53],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海溝", "生產力高"], "path": [
    {"route": [47, 33, 32, 36, 53, 54],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [59, 43, 37, 36, 53, 54],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海溝", "多樣性高"], "path": [
    {"route": [47, 33, 32, 36, 53, 55],
     "node": ["海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
    {"route": [59, 43, 37, 36, 53, 55],
     "node": ["地震","海地地震儀","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["水團", "海底山"], "path": [
    {"route": [48, 36, 32, 33, 44, 49],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["水團", "深海平原"], "path": [
    {"route": [48, 36, 32, 33, 44, 50],
     "node": ["溫鹽深儀","海洋儀器與觀測","海洋地質","海底地形","洋底盆地"]},
  ]},
  {"nodes": ["水團", "玄武岩"], "path": [
    {"route": [48, 36, 35, 51],
     "node": ["溫鹽深儀","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["水團", "大陸坡"], "path": [
    {"route": [48, 52],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["水團", "大陸棚"], "path": [
    {"route": [48, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["水團", "生產力高"], "path": [
    {"route": [48, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["水團", "多樣性高"], "path": [
    {"route": [48, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海底山", "深海平原"], "path": [
    {"route": [49, 50],
     "node": ["洋底盆地"]},
  ]},
  {"nodes": ["海底山", "玄武岩"], "path": [
    {"route": [49, 44, 33, 32, 35, 51],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["海底山", "大陸坡"], "path": [
    {"route": [49, 44, 33, 32, 36, 52],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底山", "大陸棚"], "path": [
    {"route": [49, 44, 33, 32, 36, 53],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["海底山", "生產力高"], "path": [
    {"route": [49, 44, 33, 32, 36, 53, 54],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["海底山", "多樣性高"], "path": [
    {"route": [49, 44, 33, 32, 36, 53, 55],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深海平原", "玄武岩"], "path": [
    {"route": [50, 44, 33, 32, 35, 51],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","深海鑽探"]},
  ]},
  {"nodes": ["深海平原", "大陸坡"], "path": [
    {"route": [50, 44, 33, 32, 36, 52],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海平原", "大陸棚"], "path": [
    {"route": [50, 44, 33, 32, 36, 53],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["深海平原", "生產力高"], "path": [
    {"route": [50, 44, 33, 32, 36, 53, 54],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["深海平原", "多樣性高"], "path": [
    {"route": [50, 44, 33, 32, 36, 53, 55],
     "node": ["洋底盆地","海底地形","海洋地質","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["玄武岩", "大陸坡"], "path": [
    {"route": [51, 35, 36, 52],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["玄武岩", "大陸棚"], "path": [
    {"route": [51, 35, 36, 53],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀"]},
  ]},
  {"nodes": ["玄武岩", "生產力高"], "path": [
    {"route": [51, 35, 36, 53, 54],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["玄武岩", "多樣性高"], "path": [
    {"route": [51, 35, 36, 53, 55],
     "node": ["深海鑽探","海洋儀器與觀測","溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["大陸坡", "大陸棚"], "path": [
    {"route": [52, 53],
     "node": ["溫鹽深儀"]},
  ]},
  {"nodes": ["大陸坡", "生產力高"], "path": [
    {"route": [52, 53, 54],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["大陸坡", "多樣性高"], "path": [
    {"route": [52, 53, 55],
     "node": ["溫鹽深儀","大陸棚"]},
  ]},
  {"nodes": ["大陸棚", "生產力高"], "path": [
    {"route": [54],
     "node": []},
  ]},
  {"nodes": ["大陸棚", "多樣性高"], "path": [
    {"route": [55],
     "node": []},
  ]},
  {"nodes": ["生產力高", "多樣性高"], "path": [
    {"route": [54, 55],
     "node": ["大陸棚"]},
  ]},
];

